{"post_id": "1hdke7z", "post_title": "Any update on the CSGO reborn client?", "post_body": "I can't remember which team's were working on a CSGO project but there were 2 to my knowledge. Dimawallhacks was doing an alpha test on stream a while back \n\nIt even brought back the original sounds and maps from the 2012 version of CSGO.\n\nAnd for the record, I'm not talking about CSGO legacy build which anyone has access too. These 2 projects are projects die hard fans of CSGO were working on to bring back the game to its original state.\n\nDoes anyone know the projects I'm talking about? I genuinely cannot remember the names of them and I Just want updates.", "post_score": 1, "post_author": "ZooterTheWooter", "post_created_utc": "2024-12-13 19:39:35", "comment_count": 2, "comments": ["2012 csgo was the worst, any reason you want to play it", "for real, 2012 csgo might actually be the worst version of counter strike that has ever existed, unless you go back to like the beta days of '99 or something"]}
{"post_id": "1hdgw5c", "post_title": "fnatic release afro", "post_body": "N/A", "post_score": 7, "post_author": "Westland__", "post_created_utc": "2024-12-13 17:06:36", "comment_count": 6, "comments": ["First of multiple changes after their absolute disaster vs Rare Atom", "\\-nawwk\n\n\\-KRIMZ\n\n\\-matys", "tbf afro was benched and nawwk was playing, though his future is also in question", "they're not getting rid of a core lmao. And imagine saying -matys when hes the only one providing firepower alongside blameF\n\nzero CS knowledge.", "Yeah I’m aware, it seems like the roster overall is going to get a massive overhaul", "Sometimes getting rid of the core is better. \n\nmatys is average at best, he has been on fnatic for over a year and had plenty of time to showcase his skills. \n\nHe also had a very bad major."]}
{"post_id": "1hdel9f", "post_title": "What is the \"Max 7.4ms\" stat and how do I fix it if it spikes from 0 to 30ms sometimes even?", "post_body": "N/A", "post_score": 1, "post_author": "Jasoncals", "post_created_utc": "2024-12-13 15:24:51", "comment_count": 1, "comments": ["Frametime. The time it takes to render each frame. Limiting your framerate with your graphics card control panel, RivaTuner or in-game to a little above your frame rate or the lowest average fps you commonly see can reduce frametime spikes."]}
{"post_id": "1hday25", "post_title": "Surely it's not ADR #PGLplzfix", "post_body": "N/A", "post_score": 13, "post_author": "nnosco", "post_created_utc": "2024-12-13 12:16:05", "comment_count": 5, "comments": ["Same issue on Karrigan, Zywoo ended with 58 ADR so it's another slip-up.\nWant to be charitable but the production really is legendarily sloppy.", "I'm pretty sure it's how much damage they did that round.", "But only blast does that, pgl hud only shows adr after death", "I mean that's the number that I think is shown. It's not ADR because it's not an average, but if you want to know what it's representing, it's probably that. I noticed it in the G2 game this morning.", "Weird how they’d even somehow have it show damage dealt when they’ve only ever shown adr there, masterclass production behind the scenes"]}
