{"post_id": "1h4bftv", "post_title": "So when is Ping jitter being fixed?", "post_body": "Is there a specific date when this game is playable? Or do I just have to live with permanent teleports forever in this game? Like how is it acceptable to just being dragged around every single match with no end in sight and then just after the game hoping onto valorant or apex legends and have absolutely zero network problems. What exactly are we playing here. Like some of these teleports make no sense at all. I can be standing still and suddenly the game just ports me completely to the left or right. What the hell are we doing here?", "post_score": 0, "post_author": "nikeyYE", "post_created_utc": "2024-12-01 19:37:05", "comment_count": 11, "comments": ["Whenever you'll get a new isp", "Never", "Yes exactly. Literlly every Game functions but cs2 is This Special needs child where the Stars need to align perfectly or youll be damned trying to have a good time in this game. Its seriously so tiring getting this answer.", "This clearly explains why me and like 90%, if not more, of players don't experience such issues", "Look at the bright side at least you find games i have been in a 5 stack searching for hours on end multiple days and little to no players on South Africa yet others in the same country find games.\n\nOn top of this i switch on EU vpn boom instant games 20-70 sec.", "Like he said its likely your ISP. Best case scenario its your home lines if its piggybacking off existing coaxial.", "So you expect valve to change something on their end to suit your needs?\n\n  \nGet fucked lol.", "I Always find this answer funny aswell because there have been Patches where a Lot of people Had These Teleports. Cs2 Reddit was filled with complaints. The fault was clearly on valves Side. But when only a select few Encounter the Same Problem it gets tossed at the ISP. Why wouldnt it be possible that a Network Problem only exists for couple people who are Just left Out dry because Nobody Cares? \nI mean we literlly Had Patch notes that Said the Server didnt accept your jump command so it teleported you Back in certain cases. Like why are we still saying its the ISPs fault. I dont get it.", "First of all i am getting fucked.\nSecond of all is every Performance Update a Change that suits the needs of the Players so i dont get your Point.", "Yes, people HAD problems and there WERE patches addressing those issues. But not anymore, now people with shit internet are just complaining about the game, thinking that their issues are  the same as those that people experienced in the past.", "Switch your ISP or deal with it"]}
{"post_id": "1h3vf0m", "post_title": "Where do i get map guides for the new map guide system?", "post_body": "Steam workshop guide section is a mishmash of written guides with screenshots and other content and there's no filter for map guides, at least any filter that i've seen.", "post_score": 4, "post_author": "BringBackSoule", "post_created_utc": "2024-12-01 04:44:11", "comment_count": 0, "comments": []}
