{"post_id": "1hcsrfd", "post_title": "Feedback on new map?", "post_body": "I've started making a new map and wanted to get some feedback on it. I'm having some lighting issues but those will be fixed shortly.\n\n  \n[https://steamcommunity.com/sharedfiles/filedetails/?id=3378303051](https://steamcommunity.com/sharedfiles/filedetails/?id=3378303051)", "post_score": 1, "post_author": "Classic-Minimum-9131", "post_created_utc": "2024-12-12 19:13:09", "comment_count": 2, "comments": ["Join the map making communities, there are a good number of them that organize play tests", "look up mapcore and join their disc"]}
{"post_id": "1hcms5o", "post_title": "liquid fix", "post_body": "Okay, so here is the most logical fix for Liquid heading into next season. I know everyone will solely blame Yekindar for his bad performances, but he is not the only one causing such issues. The problem is with jks as well. He is not being able to find impact on T side, and his anchoring on Anubis today was horrendous.\n\nso the fix here is -yekindar +elige and to replace jks they have to find a fragging anchor like Malbs (as m0nesy and Niko will be leaving the team after the major). Although both these transfers will cost them a lot of money but its something which might give them a chance to win a lan trophy after 5 years.", "post_score": 0, "post_author": "KrestoN-", "post_created_utc": "2024-12-12 14:53:38", "comment_count": 23, "comments": ["Ah yes. 1 series of jks having poor anchoring and he is suddenly a problem yet he has some of the best anchor stats across the scene. \n\nYou also realize that yeki has taken roles from other players at times on this team right? Aggro lurking on ancient and d2 are great examples of how that affects jks and naf T sides. Yeki is the only glaring issue. Replace him and see how the team performs first.", "bro G2 is not giving up malbs what are u smoking", "Yekindar needs to go first. His numbers have been appalling in Liquid given how he was insane back in his VP days. For a player of his caliber and talent, that is not acceptable.\n\nI dont think kicking jks now would be a good idea given that he just joined the team 5 months ago with ultimate. Not fair to him when he has only 5 months while Yekindar has been with Liquid since 2022.\n\nBest solution: -yekindar first. Keep jks and ultimate up to 1 year and see how they perform and from there, Liquid can make decisions on whether to keep them or replace them.", "As much as fans might want Twistzz to step back and bring in a new IGL, I really don’t think it’s realistic. This is Twistzz’s team and he’s made it clear he wants to IGL. I don’t think you rock that boat. \n\n-Yeki +Elige is an obvious move and maybe helps us be more competitive vs top 10 but it’s not a trophy lifting team.\n\n-ultimate +proven t1 awper (torzsi, broky) on top of that i think puts you in championship contention. \n\nBut I think ultimate has earned another 6 months at least just based purely on potential. \n\nReality is I think liquid is still a year away from being a real top 5, trophy contending team. And most of it falls on ultimates development.", "People can blame Yekindar all we want but if we're being honest, he was set up for failure the moment Elige left\n\nEver since that moment, Yeki had to assume all of the aggo/entry by himself (and IGL aswell at times) because the team is basically him and 4 of the biggest baiters in pro CS\n\nAnd it's obvious he can't do it alone and miss a second aggro guy with him badly\n\nWhoever will replace him will face the same issue unless his replacement is litterally Donk/Niko who are the only two guys that I'm sure can assure all those responsibilities \n\nNAF and jks can't be on the same team. It won't work", "also reason for not touching upon the igl issue is because if they change the igl twistzz might leave the team and join vitality,g2 etc. the only reason he is on this team is because he is the igl. might as well give him the best na players rn", "Jks and NAF on the same team can't and won't work", "jks is a really solid player but he is just a slight upgrade over skullz. you can keep jks and get elige but the problems will remain the same. it has to do more with the combination of the team rather than the players performance cuz the igl will leave the team as soon as he is relieved of the igling duties.", "Br0ky is not it", "In another thread someone mentioned +hooxi as IGL and I think keeping ultimate+ an IGL like hooxi would result in ultimate becoming a more consistent well rounded player", "elige is not close to the same player as yekindar is\n\nsure yeki sucks but elige wouldn't do that much better in a pure pure entry role", "Yet it already did on Renegades lmfao. Ok bud. NAF has the adaptability to non lurk rifle positions, just not entry positions. Jks is a hard lurk and hard anchor. Stats show that Jks is one of the best anchors in the scene right now.", "eliges malding is not great for the team also i dont think him and twistzz get along.\n\nWhen hes on elige is a great player but once he loses a round and starts malding and piuting hes a nightmare for the teams hes on.", "He averages 1.1 rating on CT side over the last 3 months against top 10. It's actually just stupid to argue that he's a slight upgrade over skullz.\n\nTL's T side is literally dog shit and it's not because of players. The calling has been awful, their ideology of how to play especially with Yeki in aggressive lurk positions, makes no sense. There is no consistent roles.", "Elige has never entried in his career, always played star rifle roles. It isn't a fit, people thinking it is have 0 understanding of the game or how teams work.", "Yeah it worked in ANOTHER game 5 years ago back when JKS was a star player that was carrying team and NAF was still in his prime and being an ENTRY.\n\nJks is now a hard lurk and NAF hasn't entried in years \n\nAlmost as if it's a completely different game and situation than 2024", "7 years ago lol", "When Jks was still an anchor and Naf was lurking lmfao. AZR was entrying during that time. If you're going to try disprove something, come with some understanding of what they were even doing. \n\nThinking those two can't be on the same team is just completely idiotic.", "That's even worse lmao", "Jks never was an anchor at any point in his career until G2 and his stand in at Faze\n\nWhy are you lying ?\n\nHe was a star player at renegades\n\nHe was the star player at 100T\n\nHe was the star player in COL (and failed miserably at it)"]}
{"post_id": "1hc8ttb", "post_title": "Fix for slow alt-tab when using stretched resolution.", "post_body": "N/A", "post_score": 28, "post_author": "razbary", "post_created_utc": "2024-12-12 00:41:32", "comment_count": 9, "comments": ["https://www.reddit.com/r/GlobalOffensive/comments/1g56n34/cs2_launcher_script_update/\n\nthis one does the thing for me (and much more)", "Does this work with faceit ac enabled?", "AHK: For patching software that you can't actually change.", "This is really cool, I swear to god I searched and searched for this solution for years lol", "That's a good question, I haven't played faceit in years. I will do my research, but I can't see why this wouldn't work as all it does is change the windows resolution, open cs2, wait for cs2 to close, and then it reverts the resolution.", "I used to use AHK + third party crosshair on FACEIT - I'm pretty sure just having AHK change your resolution doesn't ban you immediately", "I will officially test it tomorrow, but from what I can see online as long as the AHK script doesn't actively do anything to counter strike it should be good.", "Its not going to ban you but there are several posts from people a few years ago claiming faceit blocks ahk from running at all. I am not sure how it works now.", "I read into these as well, while it doesn’t seem to be directly AHK; I think it has something to do with particular scripts doing things against faceit rules."]}
