{"post_id": "1h4ep1n", "post_title": "Why is there no minimal wear and factory new versions of the Mac-10 Sakkaku skin?", "post_body": "I haven't been in the know since just recently so forgive me if I don't know my skin basics, but I honestly couldn't find the Sakkaku skin for the Mac-10 in minimal wear or factory new, not on steam market place or anywhere else. What's the deal with that?", "post_score": 0, "post_author": "Ok-Camp-6104", "post_created_utc": "2024-12-01 21:55:22", "comment_count": 8, "comments": ["It's not possible to get this skin in MW or FN only below that", "Some skins have float caps, affecting their maximum or minimum wears. The Sakkaku just has a cap at FT, [this site has the cap visualized, ](https://stash.clash.gg/skin/1543/MAC-10-Sakkaku)making FN and MW impossible.", "It has a float cap of 0.000000 to 0.800000\n\nWhy? We don't know. Valve or the skin author set it like that.", "But why", "csgostash.com was bought by a gambling website, I recommend moving to csgoskins.gg instead https://csgoskins.gg/items/mac-10-sakkaku the float caps are on the left side underneath the summary", "Arbitrary float cap set by either Valve or the skin creator. No other reason.", "float caps", "ah man thanks for the link. Had stopped using csgostash, the way they have made the site predatory is unbelievable. Popups mid browsing they know people are gonna accidentality click on them whilst browsing etc.\n\nThis site seems to be like the old one. Actually better"]}
{"post_id": "1h44ni2", "post_title": "Looks like Cache will be another map with a rainy atmosphere and feature the wet skins effects ", "post_body": "https://preview.redd.it/9kx5nh2m094e1.png?width=1080&format=png&auto=webp&s=11b944a4d77c659e7595238ee327440688896ad9\n\n[Aren't these rain droplets? I hadn’t noticed them before because they’re not very clear. Judging by the screenshot, it seems Cache will be another wet map, right? With the new \\(wet skin\\) effects added by valve to Train, Its quite certain Fmpone won’t miss the chance to use this wet skins feature in his map. As it stands, Cache might become another rainy map with wet effects + brighter lighting compared to Train. This means the map will look visually stunning \\( updating with the new rain and wet effects\\)  and skins showcasing wet effects under much brighter lighting. ](https://preview.redd.it/kjw82rul094e1.png?width=1067&format=png&auto=webp&s=1fcf665b431501d4dcd1c76437d394db6d1626b0)\n\n", "post_score": 18, "post_author": "Fun_Philosopher_2535", "post_created_utc": "2024-12-01 14:39:36", "comment_count": 3, "comments": ["I would be fine with that, would offset the bright nature of maps like dust and anubis", "gosh I love it when new \"technological advancements\" like DLSS make the screen look mushy and completely smear out small details like rain drops. GJ AAA dev studios, you really thought up something really huge here.", "CS2 doesn't have DLSS though?"]}
{"post_id": "1h3xy30", "post_title": "AK 47 | Turquoise. Do you have any idea to improve this skin?", "post_body": "N/A", "post_score": 104, "post_author": "Anxious-Specialist41", "post_created_utc": "2024-12-01 07:23:24", "comment_count": 23, "comments": ["The stock is a bit boring. Maybe make that white, broken up by the gold/copper accents?", "Pattern based?", "Turqoise means Turkish Blue, you can add Ottoman motifs to a secret pattern", "goldish lines could be more shiny and lighter. with some glitter effect too?", "Apex legends season 7", "I love it. I also like the bland stock and it allows for nice sticker placement, though I get why people don't", "Make a slytherin one", "Don’t call it that, I beg you.", "Get rid of the gold, it doesn't match", "im so tired of ak47 skins.", "make the wooden parts into gold", "Maybe a bit more gold on the end of the stock", "Need more white and gold parts, blue is way too much.", "The blue and white looks good, the gold ruins it IMO. and if you're gonna do gold, it should not be this dark... This looks almost brown. Gold is shiny and bright, not muddy and dark", "looks like valorant which is not a bad thing btw", "[https://steamcommunity.com/sharedfiles/filedetails/?id=3375398373](https://steamcommunity.com/sharedfiles/filedetails/?id=3375398373)", "This is a good blue rarity skin", "i agree \n\nbut other than that its good", "Gunsmith, paint", "imo the gold trim prevents it from being a blue tier skin"]}
