{"post_id": "1h9o7be", "post_title": "It Really Do Be Like That Sometimes. Made a patch sticker for CS, best way to introduce yourself to your team and remind yourself when things get tough!", "post_body": "N/A", "post_score": 391, "post_author": "cyberbemon", "post_created_utc": "2024-12-08 17:42:57", "comment_count": 14, "comments": ["love this", "the patch that everyone on FaZe should be getting:", " We all have tough days and its a nice reminder to yourself and your teammates, \nso I figured why not make this into a sticker. I got the idea from some patches I've seen. It comes in both paper and Foil and when you scrape it off, it removes bottom text, so you can put in whatever stickers you want to craft your own name. \n    \nThe sticker was made in substance designer, I made a patch generator for this, \nits unfortuante due to the resolution limit in CS, you don't see all the details, here is a 4K height map if anyones interested: https://imgur.com/PklLhSA\n\n\nIf you like this, you can vote here: \nFOIL: https://steamcommunity.com/sharedfiles/filedetails/?id=3380395036\n  \nPAPER: https://steamcommunity.com/sharedfiles/filedetails/?id=3380398139", "Great sticker, I hope it gets added.", "Actually could be quite funny. One player plays like ass and doesn't use mic and then sprays this graffiti at freeze time and everyone sees it XDDD", "At least give the original designer credit,\n\nhttps://retrogradesupplyco.com/products/trying-my-best-iron-on-embroidered-patch", "Please don't use the code block formatting for comment \"aesthetics\". It's not meant for that and makes your comment difficult to read on narrow viewport devices (like smartphones) because it prevents automatic line wrapping and instead adds a horizontal scroll bar to your comment. Also, any links get broken with that formatting. It's meant for snippets of programming language code where the requirements for readability are different and automatic line wrapping would be a problem.\n\n\nThe sticker itself is a great idea, one I'd actually consider buying, even though I generally don't pay any attention to stickers.", "My stupid ass thought that's a graffiti for a moment", "I got the idea from a patch I had from my uni: https://imgur.com/wUfjsy1\n\nand since this is a variation of \"hello my name is\" name tags, which is not eligible for copyright https://commons.wikimedia.org/wiki/File:Hello_my_name_is_sticker.svg \n\nI looked up the design and I found plenty of them online, didn't even know there was an original designer.", "they weren't the first person to make it neither lol", "These name tags existed before the internet was even a thing lmao", "I don't know why it showed up like that lol. I actually wrote the text on vscode and copy pasted it, my bad mate, I'll fix that now lol!", "Ah, could be some automatic \"smart\" system that uses code formatting for text pasted from a program like vscode, kind of like how Word copies and pastes text with formatting by default.", "Ctrl+Shift+V when in doubt"]}
