{"post_id": "1hb2od0", "post_title": "Why players says its only black that looks washed out when its literally the whole skin ? ", "post_body": "https://preview.redd.it/b8cya9y7316e1.jpg?width=1080&format=pjpg&auto=webp&s=2230bc1d37cebad488df0bd4bc88614c80e00ebe\n\nhttps://preview.redd.it/haz2hby7316e1.jpg?width=924&format=pjpg&auto=webp&s=2bb1b010dff566b724525e9f9b5bb0cd339e0b90\n\nSee the white, blue and the pink. Feel free to point me in which color in CS2 doesn't looks degraded  ?  The white is far more brighter in CSGO  , the black isnt grey  and blue  and pink are literally more vibrant and sharper. I think its the whole skins needs some adjustments to pop better in game. Not just blacks. Its not only black problem. The skins overall looks really washup in CS2 compared to CSGO and valve needs to improve it", "post_score": 0, "post_author": "Outrageous-Spend2733", "post_created_utc": "2024-12-10 14:14:18", "comment_count": 19, "comments": ["I think most of you don't know how lighting works.", "redditor finds out about shadows", "It is dark. You are in darkness. Things aren't bright when it is dark.", ">The skins overall looks really washup in CS2 compared to CSGO and valve needs to improve it\n\nthey would probably need to change the whole lighting system for that. making skins look brighter would make it look goofy", "Yea everything is washed. First thing I did after cs2 came was sell my asiimov.", "stattrak just look like it lost the emission altogether", "I believe all the assets are authored correctly. But the engine is doing a tone mapping/grading pass near the end. If you capture a frame with RenderDoc you will see it. I don't think there is a console command in the release build.", "Better than you", "Yes its even more washed up when in light and under shadow the black doesn't look Grey. Go outside ", "It’s already a bit goofy tbh", "I dont think so, Just needs to individually adjust the color of the skins again which is a lot of works honestly but hiring some community skins makers giving them some bucks will fix skins in no time. I have seen community skins makers are replicating 1:1 look from CSGO In CS2's lighting. Its just valve who never bothered to do all these work cause you know  they dont have the manpower.", "Turns out. If you go outside, you realize that real life isn't hyper saturated. True blacks arent really common.", "not that much i think, more realistic light and all that. sure, most of the skins were made on the old engine but if they bring the light levels back it will look like some shining stick or a flashlight in your hands that might get too distracting", "> I have seen community skins makers are replicating 1:1 look from CSGO In CS2's lighting\n\nwell, this is probably skin makers' problem if they don't want to redo their skins. valve already have things to do with the game itself, instead of fixing every skin in the game", "Probably most nonsensical opinion i have seen yet. Honestly wtf ?  Flashlight 🤣", "It’s really because the lighting/engine is not made with skins in mind. Realistically there’s so much difference to how light reacts to with different materials, but in CS2 it’s all just like when you shine the sun onto a photograph", "Its not your problem. The skins looks shit and it's a feedback to fix them\n\n\nYour random ass doesn't decide what they will fix and what thing's thye need to go.\n\n\nNo one asking your dumb opinion ", "well, skin makers don't usually disclose what type of paint is used it their skins :). it can be matte, can be metallic", "Then why make this post at all? \n\nYour random ass isn't gonna do shit either."]}
{"post_id": "1hauqmy", "post_title": "StatTrak™ digits on guns are very dim and don't look electronic (not mentioning washed out colors on skins)", "post_body": "N/A", "post_score": 1451, "post_author": "Status_Grass2847", "post_created_utc": "2024-12-10 05:32:31", "comment_count": 90, "comments": ["Wow, I didn't realize how badly the vices were nerfed until this picture", "also bring back the hud counter", "Battery of the counter is getting low", "Also bring back ERROR! USER UNKNOWN when other player using weapon", " + bring back skin rarity colour in hud.", "I would love valve to add the stattrak counter on the HUD, just like it was in csgo! Pls valve add this QOL future <3", "they took out the backlight", "Please valve care about this.", "Looks like the StatTrak™ counter is stuck on season 1", "CS2 is just so damm grey and washed out compared to GO. You REALLY notice it if you look at side by side comparison photos between CSGO train and CS2 train.", "electroNic confirmed washed", "In the pursuit of greatness, we lost good.", "it is sad when you get down to it how much cs2 still lacks detail and polish after all this time, almost reminds me a little bit of the gta definitive editions", "Also bring back clan tags", "Maybe the battery of the counter is running low. Valve should add the ability to purchase batteries with real money in order to recharge the counter !!!", "Also the should make black BLACK, not grey like now.", "God I miss csgo", "just bring back csgo already", "Also, StatTrack in the HUD as well as skin rarity colour in HUD. I don’t want to inspect every time to see the StatTrack", "The batteries ran out 😭😭😭"]}
