{"post_id": "1h92mar", "post_title": "If I buy the viewer pass after the start of the major, will I still have the coin upgraded?", "post_body": "    If I have participated in all the stages of the major so far, having made 5 hits but only purchasing the viewer pass afterwards (before finishing), will I still have the medal upgraded or will it only count the stages I participate in after purchasing the viewer pass??", "post_score": 0, "post_author": "gouveaj", "post_created_utc": "2024-12-07 21:23:30", "comment_count": 4, "comments": ["\n\n> The Pick'Em Challenge is free to play, but if you want to upgrade your Shanghai 2024 Coin (and earn extra Souvenir Packages), make sure to activate your Viewer Pass before the event begins.", "No, you need to buy and activate the pass before games starts", "    Even if I got five guesses right in the initial phase?", "Yep"]}
{"post_id": "1h8pmqr", "post_title": "How can i fix this %1 fps problem i have 180hz gsync monitor and its not feel smooth", "post_body": "N/A", "post_score": 0, "post_author": "Deep-Celebration6875", "post_created_utc": "2024-12-07 10:20:02", "comment_count": 7, "comments": ["AMD x3d CPU.", "Someone did tutorial how to fix this, need to launch gsync in nvidia, idę vsync and gap fps in nvidia", "Close discord and everything else but steamans the game. Disconnect any additional monitors.", "You have a 180Hz G-Sync Monitor but you are running it uncapped so G-Sync (VRR) is not kicking in at all, enable G-Sync in your Nvidia APP or Nvidia Control Panel (Right click on Desktop) also enable V-Sync in global settings, on top of it turn Nvidia Low Latency on Ultra so you dont have to manually cap your FPS it wont cause issues if you have a decent PC. Also make sure enabling Nvidia Reflex in your Games, it will always override Nvidia Low latency and cap the FPS automatically if you set up G-Sync correctly. Your FPS will max out under 180, its different under every Max. Refreshrate.\n\nYour game will feel way smoother, latency wont be really different and frametime more stable. Also there are lot of things that are just caused by the game beeing unoptimized like smokes, so yeah.", "launch options: -noreflex\n\nfps_max 0 in console\n\nset up a proper max frame rate cap in nvdia control panel, with low latency mode ultra or on\n\n\nMore info here: https://www.reddit.com/r/GlobalOffensive/comments/1gri2ia/possible_fix_to_frametime_variance_issues_with/\n\n\nAlso make sure you are using competive video settings: https://www.reddit.com/r/GlobalOffensive/comments/1g2cnok/video_settings_for_competitive_advantage_post/", "the map might just not be very well optimized", "its same everywhere"]}
{"post_id": "1h8p6q8", "post_title": "Heroic cheeky boost on ancient", "post_body": "N/A", "post_score": 19, "post_author": "Litigating", "post_created_utc": "2024-12-07 09:46:25", "comment_count": 0, "comments": []}
