{"post_id": "1hc7gb1", "post_title": "Complexity -Floppy", "post_body": "N/A", "post_score": 1046, "post_author": "they_call_me_justin", "post_created_utc": "2024-12-11 23:34:33", "comment_count": 266}
{"post_id": "1hc6ivw", "post_title": "AWP 4K I got in October", "post_body": "N/A", "post_score": 1, "post_author": "techSword52", "post_created_utc": "2024-12-11 22:52:08", "comment_count": 0}
{"post_id": "1hc5xwh", "post_title": "Counter Stike has a new  banner \" Smoke Dome\". Does  Anyone knows whats that supposed to means ? ", "post_body": "N/A", "post_score": 982, "post_author": "Outrageous-Spend2733", "post_created_utc": "2024-12-11 22:26:30", "comment_count": 51}
{"post_id": "1hc5oxi", "post_title": "G2 interested in jottAAA ", "post_body": "N/A", "post_score": 307, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-11 22:15:33", "comment_count": 47}
{"post_id": "1hc5die", "post_title": "Casual player, confused about pick em's. Am I missing points? I didn't get any rewards for Elimination stage either.", "post_body": "N/A", "post_score": 0, "post_author": "Rain2h0", "post_created_utc": "2024-12-11 22:02:02", "comment_count": 15}
{"post_id": "1hc4n8u", "post_title": "9z: -buda -tge", "post_body": "N/A", "post_score": 88, "post_author": "mafuentes01", "post_created_utc": "2024-12-11 21:30:15", "comment_count": 8}
{"post_id": "1hc45d9", "post_title": "Packet Loss / Lag unique to CS2 -- no stream loss but lagging in-game", "post_body": "N/A", "post_score": 0, "post_author": "dannyjunpark", "post_created_utc": "2024-12-11 21:08:54", "comment_count": 4}
{"post_id": "1hc3u4z", "post_title": "How do I lessen the impact on FPS of HEs in smokes?", "post_body": "I play on a laptop at 144 fps locked (144 hz monitor) and it never dips below unless an HE or molly is thrown into a smoke. When that happens it dips to around 70-80 fps which makes it hard to win gunfights. Anyone have a solution?\n\nBy the way I already play with most setting on medium/low if that has any effect.", "post_score": 4, "post_author": "beterpot", "post_created_utc": "2024-12-11 20:55:56", "comment_count": 12}
{"post_id": "1hc3gkn", "post_title": "We’ve made 8 iconic graffiti, because Valve couldn’t!", "post_body": "N/A", "post_score": 0, "post_author": "DTEgo", "post_created_utc": "2024-12-11 20:40:07", "comment_count": 20}
{"post_id": "1hc3e2o", "post_title": "Best way to secure A as a ct.", "post_body": "N/A", "post_score": 7, "post_author": "No-Link-2557", "post_created_utc": "2024-12-11 20:37:06", "comment_count": 0}
{"post_id": "1hc2yq0", "post_title": "I Got Cooldown For Attacking The Enemy!", "post_body": "N/A", "post_score": 56, "post_author": "No-Link-2557", "post_created_utc": "2024-12-11 20:19:06", "comment_count": 15}
{"post_id": "1hc2180", "post_title": "Endpoint win after 5 overtimes because mopoz falls off the map in a 1v1", "post_body": "N/A", "post_score": 912, "post_author": "tomtom_94", "post_created_utc": "2024-12-11 19:40:41", "comment_count": 48}
{"post_id": "1hc006n", "post_title": "Love the new Wingman map ;)", "post_body": "N/A", "post_score": 427, "post_author": "KODIAK_csgo", "post_created_utc": "2024-12-11 18:16:32", "comment_count": 10}
{"post_id": "1hbzs3f", "post_title": "a lil ace clutch I had :)", "post_body": "N/A", "post_score": 5, "post_author": "CThig_", "post_created_utc": "2024-12-11 18:07:26", "comment_count": 0}
{"post_id": "1hbxn2m", "post_title": "Strong statement from FECS pro player Zana (BIG Equipa) about the current state of female CS and the community ", "post_body": "N/A", "post_score": 393, "post_author": "None", "post_created_utc": "2024-12-11 16:39:35", "comment_count": 217}
{"post_id": "1hbwxri", "post_title": "Wall painting LOL", "post_body": "N/A", "post_score": 0, "post_author": "samuellhc", "post_created_utc": "2024-12-11 16:09:45", "comment_count": 1}
{"post_id": "1hbweht", "post_title": "(New train appreciation post)  What a beautiful map and  also improved so much from CSGO version. I think its the best thing happened to CS2 so far ", "post_body": "I already played over 50 games so far but I can't stop playing it . I simply can't get enough of it. It feels comfortable to play, whether as CT or T, and I absolutely love the atmosphere of the maps. The lighting is masterfully done  that's easy on the eyes. It's the only map in CS2 where I can play for hours without experiencing eye fatigue, unlike other overly bright maps like mirage, dust and inferno.\n\nI’m eagerly awaiting for  this map featured in map pool and playable in premier. Its a shame a map like this is still not playable in premier when Vertigone is still here. Hopefully after the major.\n\nAlso Huge thanks to the map creators at Valve  who poured their hearts into crafting this masterpiece—it's truly incredible\n\n", "post_score": 58, "post_author": "Outrageous-Spend2733", "post_created_utc": "2024-12-11 15:46:57", "comment_count": 18}
{"post_id": "1hbvc85", "post_title": "Tabbing out makes me unable to tab in", "post_body": "Like the title says whenever i tab out and i tab out for too long i cant tab back in. it shoves my internet pages to the second screen and then the game doesnt open.\n\nim trying to set up my streamlabs obs to stream cs but i just cant multitask in adjusting things and tabbing out", "post_score": 34, "post_author": "iVeL_tv", "post_created_utc": "2024-12-11 14:59:46", "comment_count": 15}
{"post_id": "1hbv288", "post_title": "Hi! I'm trying to get my friend into CS, before I'll search myself I wanted to ask here first, for some best of the best videos on how to shoot, control recoil, a/d/a/d shooting, general movement etc, like you know, go to vids.", "post_body": "They are great at the game from the get go, years of experience in other games, positioning is great, even though they don't know the maps, they do a great job, but the issue is shooting. They feel uncomfortable trying bursts even not to mention full/half auto, and just one tap everything. Sometimes that's the way to go, but other times it absolutelly get's them killed. I tried giving advice and tell them what to do but somehow they can't break through that mental wall. So give me best you got if you can, will be greatly appreciated :)", "post_score": 2, "post_author": "NoneOtherTh4nMe", "post_created_utc": "2024-12-11 14:47:14", "comment_count": 12}
{"post_id": "1hbuq6c", "post_title": "Jame has electronic on the 4th tier of CIS player rankings", "post_body": "On the same day VP benched him. Elite level pettiness 😭", "post_score": 1034, "post_author": "sealer9", "post_created_utc": "2024-12-11 14:31:06", "comment_count": 123}
{"post_id": "1hbsijm", "post_title": "Tasty lil 1vs4 ", "post_body": "Throwback to my glory days, Could never do this in CS2 smh ", "post_score": 0, "post_author": "Alternative_Rub9911", "post_created_utc": "2024-12-11 12:37:34", "comment_count": 3}
{"post_id": "1hbrnd8", "post_title": "Let's Play a Game (With Pictures!)", "post_body": "Simple really, I post a few screenshots and you guys have to tell me where my crosshair is\n\nExhibit A: The B Apartments\n\n[I promise you it exists](https://preview.redd.it/xkno7lnvg76e1.jpg?width=1280&format=pjpg&auto=webp&s=43834ccaa38db54c6e93b815aeefd2a30e914a21)\n\nExhibit B: Apartments to Stairs\n\n[can't wait to take space on B aps as CT](https://preview.redd.it/ogpbj0j0h76e1.jpg?width=1280&format=pjpg&auto=webp&s=e94487b8a3fd1d8e1eb6d38ec7910defe1e111bc)\n\nExhibit C: The TV Room/Top Mid\n\n[can't help but laugh](https://preview.redd.it/u8ojqtl7h76e1.jpg?width=1280&format=pjpg&auto=webp&s=64896df98cc67e5af01e8b542edbf0a3a0b43685)\n\n  \nI could post many, many more screenshots of not only mirage, but pretty much all maps, but I think you guys got the point.\n\nBrightness is set to 80% in-game, Saturation 140 in Radeon settings. I don't think there is anything so insanely bad with my settings that it'd screw up visibility this bad, but I'm open to suggestions.\n\nAnother thing I noticed is that the lack of contract and too much brightness actually *reduces* my visibility as CT's appear washed out into the background, and also impacts my performance as my eyes get strained, making me lose focus.\n\nCSGO had its issues in this regard, but you could always \"fix\" it going to colour settings. As it stands, there is literally nothing you can do (that I know of) to improve this situation in CS2.", "post_score": 0, "post_author": "rgr_911", "post_created_utc": "2024-12-11 11:44:04", "comment_count": 6}
{"post_id": "1hbrluh", "post_title": "ENCE have paused their Athena project | Another blow for women’s CS", "post_body": "N/A", "post_score": 317, "post_author": "PushiKuchik", "post_created_utc": "2024-12-11 11:41:17", "comment_count": 98}
{"post_id": "1hbq3zt", "post_title": "Faceit confidence", "post_body": "Hello, I have a problem with self-confidence on Faceit. A few weeks ago I was lvl 5 and I started playing seriously and every day for a few weeks I have been training prefire maps, dm, aimbotz. I started to climb on Faceit. I just reached lvl 8 and it started throwing me into lobbies where the range of players is lvl 7-9. Every time I see that I have lvl 9 against me, I start to have problems with confidence. My head keeps telling me that I can't compete with those players and then I make stupid mistakes and I'm afraid to go into a duel or clear angles. With friends who don't play seriously, I have no problem dropping 30+ kills and carry games at around 15k rating on the premiere, but as soon as I turn on Faceit, all my self-confidence goes to the trash. Has anyone had a similar experience? How can I improve in this?", "post_score": 8, "post_author": "No_Holiday960", "post_created_utc": "2024-12-11 09:54:15", "comment_count": 14}
{"post_id": "1hbq3d0", "post_title": "Age ", "post_body": "I know there are a few examples of “older”players going pro but I was just wondering the general consensus on what is the age where a player is too old to go pro?", "post_score": 0, "post_author": "notjuzou", "post_created_utc": "2024-12-11 09:52:57", "comment_count": 21}
{"post_id": "1hboowe", "post_title": "Can someone help me find the current owner of my very first knife?", "post_body": "https://preview.redd.it/hljnmms2f66e1.jpg?width=1120&format=pjpg&auto=webp&s=8d3540cab032bac17d6a33b7953f7cd43b33cbe2\n\n  \nI would really like to return my very first knife and would be very grateful if you could help me with this\n\n★ M9 Bayonet\n\nForest DDPAT\n\n0.16021227836609 FT\n\nSeed 50\n\nI was already on csfloat and found a person who had it 2 months ago. I tried to contact him for a couple of days, but he is Chinese and, unfortunately, ignores me ((", "post_score": 0, "post_author": "AiskuL_Official", "post_created_utc": "2024-12-11 08:02:16", "comment_count": 18}
{"post_id": "1hbobdz", "post_title": "Virtus Pro bench Jame", "post_body": "N/A", "post_score": 1578, "post_author": "Veber31", "post_created_utc": "2024-12-11 07:34:05", "comment_count": 233}
{"post_id": "1hbo5n3", "post_title": "Mouse reltaed configs, scripts and macros", "post_body": "I have seen some videos about using the logitech app or razer app to config some macros for bhopping or recoil. I dont trust the, especially the recoil thing but bhop macros sounds good. Does this kind of automated macros or scripts interfere with the game memory or any game proccesss? So are they bannable? Just a question since im curious, thanks!", "post_score": 0, "post_author": "AnomalyyDreamer", "post_created_utc": "2024-12-11 07:21:53", "comment_count": 6}
{"post_id": "1hbmyk9", "post_title": "Any advices on climbing faceit?", "post_body": "I just cant stand faceit lvl3, i get turks and polish people almost every game, their crossgair positioning and movement is shit and they say something about you. Im tired of being hardstuck lvl3, so im asking for any good advices of how can i considtently gain elo on low lvls with bad team, maybe its about gamesense, or even some fear of peeking or smth like that? Any advice will help.", "post_score": 0, "post_author": "wemely_", "post_created_utc": "2024-12-11 05:59:13", "comment_count": 12}
{"post_id": "1hbmusv", "post_title": "How to silence/block all e-sports related posts?", "post_body": "Sorry for the short post. I can't for the life of me figure out how to block all the e-sports related flairs? \n\nI love CS, but don't give two shits about the e-sports scene. Unfortunately, a lot of the discussion on this sub is about random e-sports teams/players, and not the game itself.  ", "post_score": 0, "post_author": "faiek", "post_created_utc": "2024-12-11 05:52:10", "comment_count": 11}
{"post_id": "1hbmuhe", "post_title": "Diamond Coin Formula?", "post_body": "https://preview.redd.it/o1sskba3q56e1.png?width=1569&format=png&auto=webp&s=6f83fd698ae33ed755251ca653fcbca9aebd0c99\n\n* **MongolZ vs MOUZ**: MOUZ has had a rough playoff run losing to MongolZ and FaZe in the elimination stage. Based on the win streak that MongolZ has had recently, I favor MongolZ to take the series.\n* **Spirit vs Liquid**: Spirit is heavily favored here. Given their consistent form and recent performances, they should overcome Liquid.\n* **G2 vs Heroic**: G2 is the clear favorite in this matchup. With Niko in peak form and G2’s overall roster cohesion, they should emerge victorious. Niko's drive for his first Major title adds an additional motivational layer, likely pushing G2 to a win.\n* **Vitality vs FaZe**: Vitality's recent performances, particularly during the playoffs, solidify their advantage over FaZe. Vitality's consistency and individual form should secure them the victory.\n* **MongolZ vs Spirit**: MongolZ has yet to secure significant victories against top-tier teams in a BO3 format. While their strong run in the Major is noteworthy, the series of close games they've had indicates they may struggle against Spirit. Spirit’s recent victories and overall form give them the upper hand here. Their victory over MongolZ in ESL Pro League Season 20 further supports the expectation that they will emerge as the winners if they maintain their current level of play.\n* **G2 vs Vitality**: This is the most challenging series to call, with both teams performing at a high level. However, G2's hunger, driven by Niko's pursuit of his first Major title, may just give them the edge in a 2-1 series. Expect this to be a highly competitive and intense matchup.\n* **Finals – Spirit vs G2**: In the final, G2, bolstered by Niko's determination, is poised to claim their first Major victory. While Spirit’s form is strong, G2’s firepower, tactical depth, and Niko’s leadership should lead them to a 2-1 victory in what will be a close final.\n\nTo note, my predictions so far have been reasonably accurate: 6/10 in the opening stage and 7/10 in the elimination stage.\n\nWould be interested to hear your thoughts on these predictions!", "post_score": 0, "post_author": "Friendly_Bass6588", "post_created_utc": "2024-12-11 05:51:36", "comment_count": 16}
{"post_id": "1hbmnuc", "post_title": "question on the existence of a \"casual\" scene like in past games", "post_body": "the most fun ive had playing counter strike, or maybe any multiplayer game, is in the defuse mode servers of 1.6 and source that would rotate through a ton of different interesting maps that werent necessarily competetively viable, though also not necessarily not either. im sure if youve played those games a fair amount you know exactly what i mean. im just wondering if there exists at all a community that plays cs2 in the same way, because i would really like to. the current server browser is basically empty for me, which i hope is just it being broken, so i dont really know how to find out", "post_score": 0, "post_author": "Blazkava", "post_created_utc": "2024-12-11 05:39:32", "comment_count": 3}
{"post_id": "1hbk6d5", "post_title": "steel: \"If there is an opportunity to play... I would absolutely consider it\"", "post_body": "N/A", "post_score": 326, "post_author": "NAND512", "post_created_utc": "2024-12-11 03:18:18", "comment_count": 157}
