{"post_id": "1h2vudy", "post_title": "I made a tool to automatically accept matchmaking matches that is easy to install", "post_body": "I've often seen people that were looking for some program to automatically accept a match so that they can go afk for a short time while queuing (e.g. toilet break) so that their friends don't need to wait for them and can search for a match instantly.\n\nMe and my friend group where also sort of looking for something like this. I found some solutions on the internet but most of them required additional software (like Python or some other runtime) to use. Then I realized that it wasn't really that challenging to implement and I went to work. The entire program is a single executable that will just run out of the box after downloading\\*.\n\nThe project is entirely open source and can be found here:  \n[https://github.com/michihupf/cs2-acceptor](https://github.com/michihupf/cs2-acceptor)\n\nI appreciate any feedback, bug reports and feature suggestions -- but I won't include features that run while in a match -- in my opinion that is cheating. This is also the reason why the killswitch button for the program is on the \\[B\\]-key as if you forget to close it, it will close when you first open the buy menu.  \nI also will (probably) not add any features that use the internet as this tool doesn't really need it /except maybe automatic updates if that is requested.\n\n\\*: As of now Linux and MacOS users need to compile the tool from source.", "post_score": 0, "post_author": "norysq", "post_created_utc": "2024-11-29 21:05:31", "comment_count": 14, "comments": ["excellent, can't wait to have even more people on my team that are afk for the first 2 rounds of the game", "Yeah, not really a fan of this for CS2. I could kinda get behind it for CSGO, where you'd often have multi-minute warmups, but for CS2 you should just be on your PC when you are searching for a match. Most of the time the game will start within 30sec of you accepting, so there really isn't any excuse for why you can't do whatever you have to do *before* you start queuing. \n\nWe already have enough idiots afk the pistol round, we don't need an automated tool to make that even more common.\n\nI think it's cool that you took the time to develop something to help other players, but I think in this case, it just encourages *exactly* the wrong behavior.", "Oh no my skins are gone!! ", "Make it send you a notification to the phone, then unintentional afks will be less of a problem ", "> *: As of now Linux and MacOS users need to compile the tool from source.\n\nCS2 doesn't even have MacOS capabilities. Not natively anyways.", "No joke a game changer for the retards I play with that every single time leave to get water.", "I don't think it will make that much of a difference, but I appreciate the enthusiasm", "I thought about this too and maybe I can implement a feature that disconnects the player if no input is detected after pressing the button. That will activate the technical timeout and will even punish the afk player if they don't come back", "Ok that made me chuckle xD", "That will require a phone app as well, I am not quite sure if it is worth it seeing as the app will probably be 10x more code than the actual program", "Oh well in that case only Linux users thanks for that info. Did not know that", "you could consider using an existing app, and just have it send a message (or a notification speciffically), not saying it is worth it, but it's 'a way' to bring it futher :)", "I will do some research and see. I am not really a fan of giving this tool internet access but a feature like this could make it better. Thank you for the feedback :D", "After doing some research I could not find any app that would allow me to send push notifications linked to the app"]}
{"post_id": "1h2t5jt", "post_title": "Cloud9 and Virtus.pro are the top favorites in Opening Stage of Shanghai Major 2024. Excluding picks for 3-0", "post_body": "N/A", "post_score": 0, "post_author": "cybershoke", "post_created_utc": "2024-11-29 19:04:33", "comment_count": 15, "comments": ["Is the C9 hype just due to name recognition or are they looking much improved?", "Top picks.... Excluding 3-0. Why?", "Was this pickem conducted only in Russia? Clown9 is kinda bad and I wouldn't call VP favourites either.", "3-0 picks are excluded btw", "Apparently C9 didn't make it in my pickems", "Ha, aint gonna get baited by furia again", "For me Complexity and VP have the easyest path to 3-0, and Also the mongolz are there", "C9 guaranteed not 3-0 honestly their more likely to go   0-3 than 3-0 (they won’t do either obviously) but i think best case for them is making it 3-2 maybe 3-1 if they play a weak team in the 3-1 game", "By Russian bots? Sure yeah. \n\nBy people with working brains? Not at all.", "Bro getting downvoted for sharing stats 🤣🤣", "I am here thinking the same. Both VP and C9 have been looking so weak before major. C9 barely made it into my 3-1/3-2 pickem. VP did not...", "All name recognition.", "I thought C9 played pretty decent in the RMR, and HeavyGod is a beast", "shit format, shit bias, shit post. Thanks cybershoke :)", "Definitely. This is the cybershoke account posting it. Wildly biased"]}
{"post_id": "1h2t44h", "post_title": "What Eastern Standard Time (EST) should I be ready to watch the tournament tonight? ", "post_body": "Hello,\n\nWhat time does the Shanghai tournament starts for East-Coast US viewers?\n\nThank you", "post_score": 0, "post_author": "Rain2h0", "post_created_utc": "2024-11-29 19:02:50", "comment_count": 4, "comments": ["10pm EST is when the first matches start. \n\n  \nJust an FYI. HLTV will take into account your time setting when displaying match start time.", "Okay, thank you!", "also if you check the shanghai major page on liqui, it displays a realtime countdown to each match\n\nhttps://liquipedia.net/counterstrike/Perfect_World/Major/2024/Shanghai\n\nthe first matches are in 6 hours, 7 minutes and 22 seconds (as of this post)", "Awesome!"]}
{"post_id": "1h2t0jc", "post_title": "Major", "post_body": "Was very hyped for this major but the times the games start made it unwatchable for me as someone with responsibilities i aint trynna stay up till 4-5 am to watch it🥲", "post_score": 0, "post_author": "Healthy-Mongoose7403", "post_created_utc": "2024-11-29 18:58:54", "comment_count": 2, "comments": ["PGL has been posting match highlight videos to their YouTube channel: [https://www.youtube.com/@Counter\\_Strike\\_Highlights/videos](https://www.youtube.com/@Counter_Strike_Highlights/videos)", "Yeah i know that but it hit different watching it live😂"]}
{"post_id": "1h2rzey", "post_title": "Top 5 Perfect World Major Prospects - Best Up & Comers/Tier 2 Players", "post_body": "N/A", "post_score": 13, "post_author": "Ne0kai", "post_created_utc": "2024-11-29 18:14:26", "comment_count": 0, "comments": []}
{"post_id": "1h2pob1", "post_title": "How S1mple Won His First CS:GO Major With NAVI (Stockholm Major Journey) - Vital CSGO", "post_body": "N/A", "post_score": 44, "post_author": "Bukkitz", "post_created_utc": "2024-11-29 16:34:04", "comment_count": 2, "comments": ["Right on time as always :)", "his only major"]}
{"post_id": "1h2p9nm", "post_title": "IEM Road to Rio 2022  Americas RMR is the only non-EU RMR in the TOP 10 most popular RMR events ever", "post_body": "N/A", "post_score": 0, "post_author": "eSportsStats", "post_created_utc": "2024-11-29 16:15:59", "comment_count": 0, "comments": []}
{"post_id": "1h2p5zk", "post_title": "Ultimate Player Profile from BLAST", "post_body": "N/A", "post_score": 10, "post_author": "iTannerz", "post_created_utc": "2024-11-29 16:11:33", "comment_count": 0, "comments": []}
{"post_id": "1h2lhv2", "post_title": "The Haters Guide to CS2's 2024 Perfect World Shanghai Major", "post_body": "N/A", "post_score": 0, "post_author": "Sevastiyan", "post_created_utc": "2024-11-29 13:12:43", "comment_count": 0, "comments": []}
{"post_id": "1h2lg3x", "post_title": "This venue (there will be audience) will host both Opening & Elimination Stages of 2024 Shanghai Major ", "post_body": "N/A", "post_score": 901, "post_author": "InternetAnon94", "post_created_utc": "2024-11-29 13:09:57", "comment_count": 96, "comments": ["Looks like the sickest power point presentation is about to drop", "I like that you specify that \"there will be audience\"", "should be standard for big tournaments like majors and cologne kato\n\nleague had those since 2013 and for some reason cs regressed in that aspect and made groups feel so empty all the time", "Kinda insane that all stages of the Major will be on stage. It's highly likely that this won't happen again, because I doubt PW will be able to put bums in seats for all of the games, but it's cool nonetheless.\n\n\nAlso RIP Mouz lmao.", "Hell yeah!!! The first day of the Rio Major to this day remains one of my favorite CS experiences. The crowd being hyped and the BO1 chaos was just so fun to watch.\n\nReally hope to see a repeat of that here!", "People in the comments are so confused... No, this isn't the playoff arena ! Previous major didn't have any crowd for the opening and elimination stage ! Just in studio.", "Just to confirm as I am a bit confused, the playoffs will have a different arena right? And these images here are separate from them?", "[Source: Perfect World ](https://weibo.com/5980136393/P2zxmfHUc?pagetype=groupfeed)", "That looks like a huge cinema, very cool.", "A smaller venue for early stages will probably translate to a better atmosphere.  Nothing sucks out the excitement more than a  near empty stadium.", "I love having a group stage crowd. This was what the Rio Major did well. In fact, I remember the group stage crowd more fondly than the elimination stage crowd. It would be great if it became standard, it was sorely missed in Paris and Copenhagen.", "why are there 4 boths? Will they have matches in parallel on the stage?\n\nSorry, havent watched a major in years.", "One screen for 2 games at the same time ? How is that supposed to work ?", "Might be a hot take, but if this is anything like rio where not all the matches were played in front of the crowd, the lack of consistency is a bad move competitively speaking. Some teams played all their matches in front of the crowd and some played all matches in the studio. Would be better if every match is on stage, but the problem still exists if the match the crowd is watching is not decided by the round of swiss, potentially creating a similar type of imbalance between teams.", "looks clean yo", "oh damn mouz are screwed then", "Where in the city is it?\n\nEdit: former 2010 world expo grounds by the looks of it: https://weibo.com/7596025298/P2B7ovTj5?refer_flag=1001030103_", "I have to say it. W crowd!", "BIG are screwed! No bedroom = NO WIN", "The early stages having their own crowd will definitey impact how the games are being played. Players will get a debuff or buff. \n\nIt is quite deserving as some of the most anticipated matches actually happen before the playoffs. Big W"]}
{"post_id": "1h2kq88", "post_title": "brnz4n Shanghai Major sticker to replace Lucaozy's", "post_body": "N/A", "post_score": 91, "post_author": "Groot_man", "post_created_utc": "2024-11-29 12:28:37", "comment_count": 7, "comments": ["valve really needs an esport only guy working for them\n\n2 big errors this tournament already which are entry level mistakes\n\nif the community didn't say anything the sticker thing probably would've gone unnoticed entirely", "I can't believe Valve is artificially inflating the value of Lucaozy stickers. \n\n.\n\n.\n\n.\n\n/S", "Good.", "end of an error", "Thanks valve, just a little too late really", "No, people who didn't play at RMR/Major don't deserve stickers, Tauson, Interz and Nawwk should get their stickers.", "Disagree. I can't say for all of them but C9 only got into the RMR by registering Perfecto as a main player when they had no plans on actually starting him. Without him they don't get to the RMR and registering him as part of the main roaster meant he was stuck on the bench and wasn't allowed to find a new team. I'm happy he got those stickers."]}
{"post_id": "1h2kppn", "post_title": "Pro's Pick'em on 2024 Shanghai major opening stage ", "post_body": "Source: Perfect World", "post_score": 418, "post_author": "Lancer0R", "post_created_utc": "2024-11-29 12:27:49", "comment_count": 48, "comments": ["Officially a pro AMA", "damn there are some wild picks there. rare atom and wildcard going 3-0 is a pretty big call. Also Fnatic, GL and LIquid going 0-3, I would be suprised to see even fnatic choke this hard", "Whos in pic 3?", "VP 3-0 on a lot of them, don't see this happening", "Big 0-3? No way lol", "Some of them need to be drug tested", "No way big goes 0-3", "Is G2 a valve org or why they also wanna fuck over BIG?", "wow i was really curious about players pickems, thanks for this", "Phzy is so based for that.", "BIG 0-3???? Man why you gotta be like that", "Why is mayonesy looking like it wasn't a fart?", "I have my fly quest on 3-0 because I’m insane like that", "i think pros are stupid", "I dont trust pro players with pickems lowkey, Ive used Pimps pickems foras long as I can remember.", "ez 4 goatquest", "Why jL so shy? :( or is that even him?", "i like how they placed col's logo", "Is pain good now? Everyone seems to think so", "interesting to see lots of 3-0 picks for liquid hmm"]}
{"post_id": "1h2jtc3", "post_title": "The Merchandise sold at Perfect World Major is sick. Hopefully available in the future outside of the event.", "post_body": "N/A", "post_score": 241, "post_author": "viridian-", "post_created_utc": "2024-11-29 11:29:41", "comment_count": 62, "comments": ["[need this smoke grenade water bottle](https://imgur.com/a/bm9KCqK)", "Here's the catalogue [part1](https://imgur.com/a/np6BuF0) [part2](https://imgur.com/a/6iqitKb) shoutout Interz for the photos!", "They're available on the Perfect World Taobao store, but if you're outside China, you'll need a parcel forwarder\n\nEDIT: Seems the link messages are being blocked, gonna try something", "I really want the teapot, it looks sick\n\nEdit: Looks like you can get it on Taobao, guess im going to empty my bank today", "just take all of my money", "Why do they get all the cool shit?", "I just saw nak (mibr) instagram and he bought a smoke and molotov plush, and when pressed, they release the smoke/molotov sound. Pretty neat", "Damn the number K doll is fire", "Valve could have been doing this with CSGO over the last decade. So many missed opportunities from such a let down of a developer.", "The water bottle is funny, should make a vape like that", "They're even supporting the local economy!", "is that a karambit pillow?", "I think I'm going to get the jacket, I still regret not buying the last PW jacket", "Damn, some of these are items are actually quite impressive looking and thinking outside the box when it comes to merchandising.\n\n  \nKey chain lanyard and smoke water bottle i'd buy.", "BRO a part of a map actually with a model goes hard.. Wow i need that in my life", "The inferno bookends... and the water bottle", "Do they sell any genuine pins on the store that can be parcel forwarded? Or is that limited to in person only?", "Can yall reply to me with the link to the online store", "Super difficult to purchase for the US, bummer.", "time to spend even more money this month 😔"]}
{"post_id": "1h2jci6", "post_title": "Help me find this CS2 S-TIer tournament match on Overpass", "post_body": "I've forgot almost everything about it except the fact that it was on a. S-Tier tournament. In a round on Overpass one team got 4 (or 3) players through Short Tunnel to Water to B only to get all gunned down by a well-timed XM1014 wielder waiting at Water. Please help me find the name of the tournament and the match between those two teams. Thanks!", "post_score": 0, "post_author": "drumgeng", "post_created_utc": "2024-11-29 10:57:29", "comment_count": 1, "comments": ["[https://www.hltv.org/stats/matches?csVersion=CS2&startDate=2024-01-01&endDate=2024-12-31&matchType=BigEvents&maps=de\\_overpass](https://www.hltv.org/stats/matches?csVersion=CS2&startDate=2024-01-01&endDate=2024-12-31&matchType=BigEvents&maps=de_overpass) these are overpasses played in big events in 2024  \nLook for what seems familiar and then go to the match - heatmaps - click through players' weapons to find the XM kills"]}
