{"post_id": "1h8cjov", "post_title": "Valve fix your damn servers, it's been in this annoying state for 2 months now. Only CS2 feels laggy to me, all my other multiplayer games are fine...", "post_body": "N/A", "post_score": 3, "post_author": "davidfliesplanes", "post_created_utc": "2024-12-06 21:41:30", "comment_count": 1, "comments": ["I think its more of the game not really been fully optimized. I have to do some setting changes just to make the game run a bit smoother but I still feel that there is lag in the movement and shooting occasionally. \n\nYou can try follow [this](https://www.reddit.com/r/GlobalOffensive/comments/1gri2ia/possible_fix_to_frametime_variance_issues_with/) if you want to. It does help eliminate around 80% of the frametime issues I had with this game. Maybe it might help you based on what the image you sent."]}
{"post_id": "1h89xzt", "post_title": "Fnatic boss confirms: Roster changes are happening ", "post_body": "N/A", "post_score": 182, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-06 19:46:44", "comment_count": 62, "comments": ["I love how matys is one of their best prospect and he's using the worst mousepad imaginable.", "Keep matys as well", "Any actually interesting tidbits in this 9 minute video?", "Boddy is out for sure and probably Krimz.", "-matys -bodyy -krimz -naawk +stavn +device +k0nfig +jabbi", "\\-bodyy -Krimz", "Snappi and sunpayus are right there", "Anyone know if Krimz is interested in coaching or still playing? He still has some firepower and the brain obviously. Curious for his future", "Drop the entire roster except matys and blame pick up snappi sunpayus and try to scavenge pick up a solid t1 player for the last spot", "Snappi Sunpayus BlameF Matys and add one more for a spicy AF roster.\n\nYou have an adaptable experienced IGL, a star awper who can punch hard and get stable results, a star rifler that has sharp mechanics and high confidence, and a young talented opener. \n\nFind another talented anchor/lurker to round out the pack and you have a great lineup", "sad times for fnatic's fan to be honest.. I keep watching Eyeballers with JW and sometimes Flusha and I do it because i like them as a players and I keept watching Fnatic because of Krimz, but changes are needed..", "\\-body -matys +cArn +dsn", "Let build roster around BlameF and miss the next major, just like Astralis.", "Dude has the most crusty, beaten up mousepad in the history of professional esports and I love it lmao", "also left handed talent", "treasure map", "Listen to it and tell us.", "nah, nawwk is absolutely more likely to get dropped over KRIMZ getting benched. He straight up played worse than afro.", "every team stabbi joins turns to shit... unless its a group stage", "As much as I hate to say it I agree, Krimz is and always will be a legend - for the game and Fnatic but his time has passed."]}
{"post_id": "1h892ue", "post_title": "ropz on changes: \"No one knows what's behind those doors, a lot is hanging around the Major\"", "post_body": "N/A", "post_score": 228, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-06 19:09:14", "comment_count": 61, "comments": ["Who is even the obvious cut? I assume Broky by the match threads but he's super annoying against Liquid when I watch him \n\nI look forward to the Twistzz rumours that no doubt will surface", "I honestly don’t think that this team needs changes. I agree with ropz that they’ve been on an upwards trajectory for a while now. The previous faze iteration also had its down time and worse season but still managed to pull it back after some time. I would give this team also some time", "I find it really hard to grasp why people assumes a team needs a roster change everytime it flops for half a year of a whole year.\n\nTheoretically, if 5 players have more time playing with each other surely they'd figure out how to play with each other to an extent where everything is efficient but apparently and practically that doesnt seem to be the case.\n\nMakes me wonder though, how many orgs have missed winning a tournament because they didnt give their roster enough time to \"click\" and dropped a roster that wouldve won an event.", "Rain is not the problem in Faze especially in last 3-6 months. He is not playing many \"star\" positions. The biggest problem in Faze is Broky current form. If sniper is underperforming, missing many \"easy\" shots and making many risky moves it will hurt any team.", "Faze monesy 🙏🏽", "-frozen +Niko -broky +m0nesy /s", "If faze cut rain I want him on liquid asap and I assume twistzz would as well", "ah the usual boring poaching good players from tier 2 teams pipeline ", "-frozen -broky +Niko +m0nesy", "-broky +s1mple -karrigan +siuhy lesgo!", "downvote all my comments in this thread all you fools want, I'm getting the last laugh in the end lmao.", "No matter what happens, even if FaZe somehow win, I think it's safe to assume that this is still the end of the line for this iteration of FaZe. One massive victory should not excuse the collapse the team had for most of the year, this roster just can't stay together any longer. And considering every other major name barring likely NAVI is likely going to participate in the post-Shanghai rostermania, it would be a mistake for FaZe not to do the same.", "he gone", "They should probably move off of the older players(Karrigan, Rain) and bring in a younger player. I really like what Wildcard is doing with JBa.\n\nMaui or Dust had a fantastic observation about how they moved JBa to CT positions and T roles where he’s shadowing and trade fragging with the more experienced players who are intelligent mid round decision makers.\n\nIn MR12, I feel like there is more emphasis on skill diff over tactical nuances.", "IMO depends who's available. If Elige is willing to play for EU,  -rain (or -ropz and make Frozen take his role) makes sense. If Spinx is available, -ropz. If faze can afford him, s1mple could ostensibly replace rain, or if he wants to AWP, broky. But the most important thing is team chemistry and idk if any of these options are good for that", "its rain. Please don't argue with his current performance at the major, he was pretty bad for most of the year. Having a solid performance at the right time does not excuse the obvious.", "I think one of the strangest problems they have, and it's super frustrating to watch is that they never all show up at the same time. Someone is always sandbagging hard enough that someone else has to really step up and have a standout performance just for them to stick in games with teams that should be walking", "Broky has been super inconsistent for a while and I'd argue he's not up to par.\n\nThe other possible issue is Karrigan. He has always had a bit of a longevity issue, he does his best work when he has a new player (or players). I feel like he helps define a meta, but once it's set he struggles to reinvent his teams to stay relevant. \n\nCS2 came and no surprise Karrigan's team dominates, figuring out how to play CS in the new engine with the new smokes is basically Karrigan's wet dream. But once he's somewhat defined that meta, his team dips.\n\nReplacing broky might give faze new life, especially since it gives Karrigan a new awp to play around with.  I don't know how long it would last though.", "They had enough of the time to perform, they've been with frozen for a full year at this point. They HAVE to change out someone in this roster if they want to hang with the best. If they won't, they will drop down further because teams such as Falcons, G2, Na'Vi, Vitality will shake up their rosters. If they won't change, they simply will be lagging behind those teams.", "Show me a team with constant roster changes that actually sees success."]}
{"post_id": "1h7zftv", "post_title": "What a stunning map! De_Vostok was supposed to be in CS:GO, but it was never released and remains a piece of cut content", "post_body": "N/A", "post_score": 133, "post_author": "Fun_Philosopher_2535", "post_created_utc": "2024-12-06 11:38:22", "comment_count": 19, "comments": ["This game does not need maps like this, we need additional copies of Mirage and Dust 2, even more boring and beaten to death than the first ones.", "i was going through the maps that have been in the game but removed just the other day. so many great maps that i will literally never get to play on again which is kinda sad :(", "it wasn't very fun to scrim in cz\n\nI played it alot lol", "Fuck I'd love it so much if valve did lots more of maps for the rotation.\n\nI love the current map pool but for the last 5-6 years I only played and watched the same what, 10 maps?\n\nWould be cool that every major they switch out 2 maps from the pool; 1 comes back from the 'already used pool' 1 is brand new.\n\nFor the 10 maps, from memory\n\nAncient\n\nAnubis\n\nD2\n\nInferno\n\nMirage\n\nNuke\n\nVertigo\n\nOP\n\nTrain\n\nCache\n\nCobble\n\n...cant remember much more maps that were in the comp pool ever.\n\nEDIT: Just verified [https://www.reddit.com/r/GlobalOffensive/comments/oo7uwy/overview\\_of\\_the\\_active\\_duty\\_map\\_pool\\_through\\_the/#lightbox](https://www.reddit.com/r/GlobalOffensive/comments/oo7uwy/overview_of_the_active_duty_map_pool_through_the/#lightbox)\n\nThose 11 maps are the only competitive maps since DH Winter 2013.", "It look very depressing", "If someone claimed its the speculated leaked version of the snowy cobble made for CS2 I wouldve  believed it.", "Not the slightest bit of shadow under the truck ..", "Is this made by valve? I’m gonna check it out.", "Vla de_Vostok (excuse the pun, it had to be done)", "Tbh I'm not sure why they left in Nuke or Inferno, my russian speaking teammates never pick them anyway.\n\nWe could use dust 3 and dust 4 instead of these, just take dust 2 and make it out of cobble and cache assets.", "Never say never!", "The color palette is very white/grey, however this to me is intriguing because itd be great contrast for player visibility", "So is new train but the map is super atmospheric.", "Cause the truck is already under the shadow. How do you cast shadow in Shadow 🤣?", "This version is a recreation of the version made by hidden path entertainment, one of many maps by them that was cut before the games release for not being fun enough. Though Vostok was also originally a condition zero map that was also nearly cut from release for the same reason.", "Train is more lively thanks to the active train and glowy lights everywhere and shiny surfaces  \nVostok here look like a dead city", "It would still be darker below the truck. Have you ever been outside?", "Precisely the point of this map. To give it an eerie feel. The vibe when you are in the map feels unreal.", "Hahahaahaha. The is hilarious. How tf the truck  cast shadows if the truck isn't blocking any light source? Its in the shadow itself. To cast a shadow you need to obstacles any light source and there isn't one ? \n\nLook at 1:10 and 0:41 . These cars are  casting shadow cause its blocking the light source"]}
