{"post_id": "1hak126", "post_title": "Major pass", "post_body": "\nHello, If I participated in the Pick 'Em challenge from the beginning of the major but didn't buy the viewer pass, will I receive rewards for the challenges I completed without the pass if I buy it now?\n\n", "post_score": 0, "post_author": "Husarz1655", "post_created_utc": "2024-12-09 20:50:49", "comment_count": 3, "comments": ["No, \n\n> The Pick'Em Challenge is free to play, but if you want to upgrade your Shanghai 2024 Coin (and earn extra Souvenir Packages), make sure to activate your Viewer Pass before the event begins.\n\nIf you activate now, you would only be able to get points from the last stage, as it hasn't started yet.", "You could still get silver coin if you guessed quarterfinals, semifinals, and grandfinal correctly", "Not worth buying the viewer pass now - unless you really want the bronze coin guaranteed."]}
{"post_id": "1hacm9u", "post_title": "Players to-do list in playoff", "post_body": "Just setting a little target for every player in playoff\n\nDonk: 1.38 rating overall\n\nShiro: 2 1v2 or more clutches\n\nZontix: HS%>45%\n\nMagixx: KAST>65%\n\nChopper: not run into stack for at least 40% of the round, reach SF\n\nSenzu, Mzinho: rating 1.15 or above in playoff\n\nTechno4k, 910: KAST 75%, \n\nBlitz: not to throw 5v2 or 4v2\n\nYekindar, Ultimate: SPR>0.3\n\nTwistzz, NAF, JKS: be themselves\n\nJimpphat, Brollen: Trade every death of xertion\n\nXertion: entry success rate>45%\n\nTorszi, siuhy: not throw away 11-X scoreline \n\nKarrigan, rain: don’t get 1-xx kill feed\n\nRopz: throw away his Porsche\n\nBroky: don’t eat Wallace before game, win 2 clutches, 1 awp  kill per awp buy\n\nFrozen: be himself\n\nSpinx , flameZ: no solo peaking or die in vain\n\nApex: not get F U apex chant\n\nZywoo: 1.4+ rating\n\nMezzi: 1.2 CT rating \n\nNertZ, degster: at least put up a fight and not die in vain \n\nTeses, Sjuush: proof they are not systematic player, not to bottom frag \n\nKysxan: out-call snax for at least 3 rounds\n\nNiko, Hunter, Monesy, Malbsmd, Snax: win the major", "post_score": 2, "post_author": "tossquid", "post_created_utc": "2024-12-09 15:45:08", "comment_count": 0, "comments": []}
{"post_id": "1habeiv", "post_title": "Shanghai Major playoffs arena from outside ", "post_body": "N/A", "post_score": 2496, "post_author": "kazarn", "post_created_utc": "2024-12-09 14:51:02", "comment_count": 70, "comments": ["They removed faze ahead of time", "Faze where?", "do we know anything about the Capacity?", "Faze RIPBOZO", "I heard it's a 360 stage", "this is so cool", "[Kinda reminded me of these in the thumbnail](https://s.hdnux.com/photos/01/20/24/23/21054705/4/rawImage.jpg)", "It's like they also know what is about to happen.", "what a view, the stadium looks clean at night", "Very cool. I remember the PGL Stockholm Major in 2021 had something similar, with the currently playing teams and the match score projected on the side of the arena. [The match score is being projected onto the side of the Avicii Arena : r/GlobalOffensive](https://www.reddit.com/r/GlobalOffensive/comments/qmno0g/the_match_score_is_being_projected_onto_the_side/)", "Man the stadium this year looks crazy nice - sick how they have the team logos on each of the pillars", "sick <<<3", "The team not appeared in the image will win the Major", "they know FaZe already lost", "been off a couple of weeks so i guess they mised faze in the middle and navi in the left... am i right? T_T", "Let’s gooooooo", "Sky don't lie", "Ue, a Furia tmb não está no campeonato???", "They know Faze hasn't got a chance in hell", "They had an extra spot and still didnt put Faze 💀"]}
{"post_id": "1haaus3", "post_title": "Found my ELEAGUE Boston goody bag while cleaning out my closet.", "post_body": "N/A", "post_score": 442, "post_author": "super_shogun", "post_created_utc": "2024-12-09 14:25:20", "comment_count": 18, "comments": ["I didn’t get that badge OR that bag! Looks great!!", "This is awesome! I have two bags and all of the goodies still :)", "Still have all my ELEAGUE goodies too! I still use the fidget spinner occasionally and my lanyard has all the pins still on it", "My bottle is so busted and bruised at this point. What an awesome event", "Met my best friend at that major. Boston really made me proud, Agganis Arena was rocking like a Bean Pot tournament hockey game.", "I still regularly use my IEM Oakland 2018 drawstring bag to take on hikes haha", "Who else still has the portable charger", "All of these items i have tucked away in my Pc parts bin. Except the power bank, lanyard and beanie. Use those two frequently while the lanyard i have on display.\n\n  \nIm surprised you kept the RFID bracelet.", "Eminem is that u?", "I want to go to a event so bad. Need something in the Southeast close by. Atlanta has to be a spot at some point", "I want it!", "This reminded me, I paid for a goodie bag for ESL One NY, and they didn't have the bags!", "I miss IEM Oakland, had so much fun going to the Oracle Arena to watch some CS", "mine stopped working a couple months ago and I only was able to get like 25% out of it, but that thing got me through college lmao", "I got some skeletons in my closet and I don’t know if no one knows it", "Yeah, I feel like IEM Oakland stopping left a void of larger tournaments in SoCal that never really got filled after", "True, which is sad since the 2 years I went to Oakland (didn't go to San Jose) the CSGO side was absolutely packed and filled to the brim.", "we need a west coast major... badly."]}
{"post_id": "1haacoz", "post_title": "Mongolian broadcasts set a viewership record during the Shanghai Major Elimination Stage", "post_body": "N/A", "post_score": 184, "post_author": "eSportsStats", "post_created_utc": "2024-12-09 14:01:08", "comment_count": 3, "comments": ["That's 1.56% of Mongolian population, it'd be 5200000 viewers if same percentage of people watched from the US", "I'd be willing to bet enough of those had multiple people watching that the real viewer count was 2+% of the population too, even if it wasn't, it's still an incredible feat", "The morning games definitely had multiple viewers behind each view, people were having watch parties in their classroom and at work. Evening games in bars and pubs"]}
{"post_id": "1haab70", "post_title": "Mac's Major Playoffs Pick'ems (Mongolz making history!!)", "post_body": "N/A", "post_score": 47, "post_author": "Mac_AU", "post_created_utc": "2024-12-09 13:59:15", "comment_count": 7, "comments": ["Who is mac?", "Nikos dad", "the guy who invented cheese", "You hear them folks talk about positive masculinity. That's Mac.\nGym.goer.\nMental health advocate.\nMongolz supremacy believer", "The man who wreseled a spider on stage in front of 15k people IRL", "Tell him Falcons bad for me, will ya?", "Ill bring it up at christmas lunch"]}
{"post_id": "1ha9xzx", "post_title": "zonic: \"From day one of signing this team, we knew that this roster was only temporary\"", "post_body": "N/A", "post_score": 367, "post_author": "Westland__", "post_created_utc": "2024-12-09 13:40:53", "comment_count": 67, "comments": ["When you really think about it, everything in life is temporary, even life itself. Based zonic.", "Great so Snappi who was promised a different roster and that the first year doesn't matter gets cut, but zonic stays on? I would be pissed", "it's honestly impressive how incompetent an Org and it's management can be\n\nand the funniest part is that eventually they will probably find some success anyway because money", "can't find any success so he blames everyone but himself, nice one zonic.", "We already knew lil pup\n\nBtw does this temporary roster include the coach? Just asking.", "So he left Vitality for this dogshit project, knew it was gonna be a disaster but decided to go anyways because he knew it was only temporary?\n\nMan Zonic really is restarted huh?", "I swear I saw this same post except that zont1x was the one saying that line. Unless my eyes were playing a trick on me.", "It must be easy simply shifting blame away from yourself and to your players. \n\nFirst, he didn't get the players he wanted, despite what should be an infinite budget. So no one was convinced to work with a 5 times major champion coach?\n\nThen, when he gets replacements, they under perform under his leadership. But who's fault is that? The players themselves?\n\nFollowing that, he and Snappi cannot settle on a playstyle. And who was meant to solve that? The players that didn't join Falcons or the lack of firepower?\n\nLastly, he says;\n\n>\"If people think that I have handpicked [the 2024 lineup], they are gladly mistaken,\" zonic said.\n\nSo now the rumors are that Magisk is taking the IGL role. Is that Zonic's handpick? Or is it his handpick if it succeeds, and a last minute solution if it fails?\n\nWhat about Niko? Is he a handpick if he succeeds, or a last minute solution if it fails?\n\nLastly, he said he replaced Dupreeh with Flamez. So why didn't he handpick him for Falcons as well? We know part of the answer to this one, it's about his nationality, but is this another setup for the next episode in the failing Falcons experiment to blame? Zonic couldn't once again get his player. If only Zonic could get *his* choice it would all work out. At some point he should return to Scandinavia, Astralis and NIP are missing a clown.\n\nThis is like playing chess and complaining that not every single one of your pieces are queens. The reverse Mourinho, who said he would win the Champions League with 11 Azpilicuetas.", "Keep saying it dude, maybe we'll believe you next time.", "zonic is an actual fucking fraud", "Bro expected not to take a reputation hit working for a sportswashing org?!?", "Reading this, I hope Zonic will be forever stuck in an infinite overtime match against flipside.", "This is just a secondary source covering the same interview that was posted yesterday", "padeling back sooo hard right now", "I await the book \"ZONIC - The Falcons Story: when life keeps giving you lemons when you clearly wanted a wagyu steak\"\n\nOr \n\n \"ZONIC - The Falcons Story: eSports' incredible journey, this time in the wrong direction\"", "Zonic loves that Saudi money", "lmao .. of course now he says it was \"just temporary\" after failing everything there is to fail xD", "IMAGINE A SOCCER OR NFL/NHL HEAD COACH SAYING THIS ABOUT HIS TEAM.\n\nFuck this washed loser.\n\nI guarantee you any top sport head coach would NEVER say something like this about his players…\n\nWhy?\n\nBecause it’s how you fucking lose the locker room.\n\nIt’s why they started off bad, and have not gotten better…\n\nBecause they know their HC is a joke and doesn’t actually care about his players or wellbeing.\n\nI mean hell, didnt he say from the beginning that the team was mainly second and third choices???", "Which is weird because when you came in you said everyone was going to get a fair shake.", "What a waste of time"]}
{"post_id": "1ha7w10", "post_title": "PashaBiceps visited Ultimate in China ahead of the Major playoffs ", "post_body": "N/A", "post_score": 2233, "post_author": "Serion512", "post_created_utc": "2024-12-09 11:44:02", "comment_count": 63, "comments": ["For those who don't know Ultimate actually began his professional career at Pasha Gaming Camp. Over the years the polish legend supported Roland, defending him when he was accused of cheating and suggesting him to various prominent teams.\n\nAlso a fun fact. Pasha got the Major MVP in 2014 in the 2nd CSGO major. Now exactly 10 years later ultimate can repeat his achievement by getting the MVP in the second CS2 major", "One of the best human beings in the scene. Thank you Pasha for setting a positive and beautiful example for future generations to come. You're my brother my friend!", "Unreal to think a random Polish tier 3 (if even that) player got yoinked by an NA team, and 4 months later he's in the playoffs of a major, his first one no less.", "Pasha is such a great guy", "It is a great feeling to see veterans investing time and money not only for themselves but for the future and for the youth. Not everyone needs to be a FalleN or a pasha, but I still respect the great work they have done.", "He didn't continue the tradition of travelling to Majors like with a bike or something?", "Common Pasha W", "I love how committed Pasha is to visiting them when it comes to supporting his fellow Polish players in the majors.", "pasha is a beast. He seems to be a solid person.", "The Strongest Polish AWPer In History & The Strongest Polish AWPer Of Today", "papito gigachad", "As a polish dude, I believe pasha is on par with fallen with how much he contributed to their countries' scenes. Polish cs is dead anyway but I strongly believe we wouldn't have guys like siuhy and ultimate without his contribution. We have strong tier2-3 presence with monte, rebels etc. as well. This game would be dead here without extra effort from people like Pasha.", "austin reaves??", "Oh god. He parasailed on an mtb all the way to Shanghai didn't he?", "did pasha bike to china", "But did he bike there? If not, he weak!", "So do they sell those referee jackets or..", "No homo, my friend", "This man is a legend", "I have never seen ultimate display so much emotion damn, you can see this means a lot to him."]}
{"post_id": "1ha7a3g", "post_title": "Weekly Premier/Matchmaking/Cheating Discussion & Complaints Thread", "post_body": "Welcome to **Matchmaking Monday**! This is the weekly megathread where you can share your experiences, complaints, and feedback related to:\n\n* Ranked & Unranked Matchmaking\n* VAC, Hacking, and Cheating\n* Prime, Trust Factor, and Trusted Mode\n* Ranking\n* Queuing and Lobbies\n\nFeel free to discuss your matchmaking experience, rant or vent, discuss ideas & share feedback for improvement, and talk about your recent games.\n\n# What you should know\n\nKeep in mind that there is a limited amount of information available about these systems and how they work to keep them effective. If you have questions, here are some resources to review:\n\n**Trust Factor**\n\n* [Trust Factor Matchmaking FAQ (Steam Support Article)](https://support.steampowered.com/kb_article.php?ref=5966-WKLC-4172)\n* [The Trust Factor: CS:GO Blog Post](https://blog.counter-strike.net/index.php/the-trust-factor/)\n* [Everything About Trust Factor](https://www.reddit.com/r/GlobalOffensive/comments/m3vk43/everything_about_trust_factor_that_i_could_find/) by u/awsmninja\n* [GDC Presentation by John McDonald (Valve)](https://www.gdcvault.com/play/1024994/Robocalypse-Now-Using-Deep-Learning)\n* [Do you Trust the Trust Factor?](https://www.youtube.com/watch?v=IpKgLAE1OdY) by u/3kliksphilip\n\n**Ranks**\n\n* [Competitive Skill Groups and Profile Rank](https://support.steampowered.com/kb_article.php?ref=5629-WUDL-8495)\n\n**Bans**\n\n* [Myth: Why doesn't Valve ban cheaters?](https://steamcommunity.com/app/730/discussions/0/1621726179584501164/)\n* [Competitive Cooldowns and Bans](https://support.steampowered.com/kb_article.php?ref=1203-WJCV-7019)\n* [I've been Overwatch banned](https://support.steampowered.com/kb_article.php?ref=5393-TLZX-2230)\n\n# What you can do\n\n**Give Feedback:**\n\n* Posting feedback or complaints on the subreddit is **not** the best way to get the attention of the developers. If you have any specific feedback to give, you can email the CS2 Development team here: [cs2team@valvesoftware.com](mailto:cs2team@valvesoftware.com)\n* They do read every email received, but are not able to reply to each one.\n* If you're experiencing low-quality matches, it is always worth emailing them. They use these reports to help improve the system.\n\n**Report Cheaters:**\n\n* Report cheaters using the in-game report system by right-clicking their name on the scoreboard, and clicking \"report\". If the game is over, report their Steam Community profile.\n* If you notice certain trends or have other feedback, you can email the developers using the email address above.\n* To report a specific cheat, follow [these steps](https://support.steampowered.com/kb_article.php?ref=7849-Radz-6869#report) to notify the VAC development team.\n\n# The guidelines\n\nWhile we encourage discussion about these topics, as a reminder, the following are *not* allowed. Note this isn't an exhaustive list, and you should review the [r/GlobalOffensive Rules](https://www.reddit.com/r/GlobalOffensive/about/rules/) before commenting.\n\n* Accusations towards any player related to cheating\n* Posting profiles of alleged cheaters (if posting pictures of matches, redact any usernames)\n* Posting any cheating gameplay footage\n* Reporting cheats, linking to cheats/websites, or discussing cheats in technical detail\n\nThis weekly discussion thread does not change any of our existing submission rules - you're still allowed to discuss these topics elsewhere on the subreddit as usual, but we do remove a large number of them as they quickly become repetitive and the majority have little meaningful discussion. If you decide to make a separate post instead of utilizing this thread, we encourage you to focus on starting meaningful discussion or providing constructive criticism.", "post_score": 5, "post_author": "AutoModerator", "post_created_utc": "2024-12-09 11:02:21", "comment_count": 12, "comments": ["12 years without a working anti cheat", "I've started playing premier lately and I'm now above 27k rating. The number of cheaters there is insane. I don't understand why the game doesn't allow us to surrender in situations like this. We have to sit through the entire match watching them spinbotting. Sure, you can stack up and push one position as a team but why waste time when surrendering would be a better option?\n\nCurrently, you can only surrender if someone leaves the game, gets banned and lose 1000 elo.", "The game is beyond any repair, Completely infested with cheaters. Be it casual or competitive. There is no saving this, it's beyond anything Valve can pathetically try.", "cheating problem has never been this bad. people in premier copy pasting their cheat links and showing off based on who has the more expensive one. \n\nand those are the obvious ones. there are people who are using wh/radar and toggling it on and off. \n\ngame is dogshit and valve doesn't care.", "Hi guys, i've posted a question and got deleted twice.\n\nI was wondering, how on earth does TRUST FACTOR work?\n\nI quitted CS2 on december 2023, came back a week ago. Started playing premier and lost my first two games and won the third, after the third game, i went to low trust factor (yellow i believe), i knew because i lost all the games blatantly against spinbots, then on weekend i had nice games where i played with normal people (premier and competitive), but i still see 4 or 5 people in \"looking to play\", today i played premier with cheaters (on my team and against), but when i play competitive i see a lot less cheaters, i just played a premier match where i believe there was no cheater at all, but i still see only 3 or 4 people on \"looking to play\".\n\nCan anyone give me a few hints on how to recover green trust factor? i've been told i need recommendations but i don't believe is that simple, i played casual for two days before weekend and on weekend i had chill games with normal people.\n\n[https://csstats.gg/player/76561199387416405#/matches](https://csstats.gg/player/76561199387416405#/matches)\n\nthat's my profile", "the fact that cheater problem has been accepted by the community as part of the game is the really sad part. either go play faceit or improve your trust factor and hope that you won't be queued with cheaters. this is how everyone treats the problem.\n\ncomplete garbage game and garbage community.", "ok boss", "How does it not auto ban spin botting? I get kicked if i mindlessly hit my buy binds over and over.", "Because CS2 is kept alive by some skeleton crew. That's why the updates are so pathetic. Valve seems to have given up completely on combatting cheaters anyway.", "You can email steam about your trust factor, and they may investigate your profile and manually adjust it. Other than that, nothing you can do, at that rank I've seen a lot of spin botting.", "How's possible that I get paired with people with green trust factor? This week I played with two guys in two separated matchs that told me they only got games with cheaters when playing the game I was on, other than those games they had fun and normal matches, the thing is that when we searched for other games in the same lobby they didn't get the \"low trust factor\" warning, but they have 20 people on \"looking to play\" while I only have 4/5/6, sometimes 14 at max"]}
{"post_id": "1ha6siv", "post_title": "How would CS change if there were 9 maps in the tournament map pool?", "post_body": "Purely hypothetically, what impact would expanding the tournament map pool to 9 have on the esports scene? Purely theoretically it is doable soon +Train +Cache. ", "post_score": 0, "post_author": "Perakk", "post_created_utc": "2024-12-09 10:27:16", "comment_count": 9, "comments": ["More messy CS since it takes a lot of time to master wider map pool. BO3s could also be more coinflips and bans could be shifting between 2 maps. BO5s would be more fun, but would also definitely spark discussion of introducing BO7s in tournament finals. \n\nOverall I'm not a fan of the idea.", "I think the quality of CS would go down. Either you wouldn't be as polished on all the maps as you'd want to be (aka spread too thin), or you'd focus on a portion of the maps and therefore fall short on the others. \n\nAlso in the end it probably just adds a 2nd perma ban to each team in a bo3 situation which just kind of kills it in practice.", "Generally lower quality games from tactical standpoint. Teams would have less time to hone down their defaults per map, which either leads to more gimmick strats being used or lower quality defaults.\n\nMore upsets. Bigger map pool incentives especially lower ranked teams to become specialists in 1 or 2 maps to generate as much upset potential as possible.\n\nWe could potentially see more different ideologies from teams (execute-heavy teams vs. map control/default). Maps like Train, Mirage, Cobble and Cache would be favored among execute-heavy teams etc. This has arguably been missing from professional CS for a few years now. \n\nWhen I think about it, I'm not sure how picks and bans would go. Right now its Ban, Ban, Pick, Pick, Ban, Ban, Pick. Would teams get two bans in first or second phase?\n\nBO1's should be abolished from every competition. It's arguable that they shouldn't be a thing even now and the map pool of 9 would make that even more apparent.", "For the worse - quality would go down and there would be more burnout due to the players having to prep more maps.", "Just adds one more permaban per team", "Bo1s is sort of needed in tournaments. In the Major, for example, you have 8 games in the first round. Split them out across 2 streams, and you are looking at 12 maps of CS, which probably takes comes out to 12 hours of game time. Factoring in tech delays and breaks between maps and games, and it could easily run 15 hours, or 10 in the morning to 1 in the night. That seems unfair to me. And I don't know if running 3 streams makes sense financially", ">Maps like Train, Mirage, Cobble and Cache would be favored among execute-heavy teams etc. This has arguably been missing from professional CS for a few years now.\n\nThis has been missing from pro cs because you just don't play exec heavy playbooks with how unpredictable rounds go, you can't expect every little detail and have a set protocol for everything. It's not map dependant, it's just the current meta, \"executes-heavy teams\" are a thing of past.\n\nBesides, we have no idea how train and especially cbble or cache would play out on pro level. I'd even argue your split into default- and execute-heavy teams would suggest all of these to be default-heavy anyway.", "I think when most people advocate for the removal of bo1s they are also advocating for a format change to account for that"]}
{"post_id": "1ha2o7f", "post_title": "will zywoo be the goat if vitality wins the major？", "post_body": "he will have more major and mvp and top1 than s1mple", "post_score": 0, "post_author": "jamesandkobe", "post_created_utc": "2024-12-09 05:27:36", "comment_count": 21, "comments": ["Zero cultural impact so no", "Will be in the conversation for sure", "No.", "Nope. s1mple is the CSGO GOAT. That's never going to go away.", "he is already G O A T", "No lmao.\n\nIf S1mple got to play Into the Breach, Apeks and GamerLegion he'd have another major, instead he was going against prime SK gaming carrying a bunch of Americans as an 18 year old. Then going against prime Astralis, Faze and Liquid with TACO. Then when he finally got good teammates he beat the #3, #4 and #9 teams in the world in the most dominant major win of all time.", "I don't think so", "If you are french yes, otherwise no", "s1mple was robbed of every top 1 he lost to ZywOo, so no.", "bro i m talking about goat of csgo and cs2, you can't separate them apart.", "s1mple fanboy haha", "It’s too early to talk about the goat of CS2 if we’re resetting and not including anything from CSGO", "OK, I'll give you 2019, but he was definitely robbed in 2020.", "cs2 is just a new version of csgo, you can't separate cs2 from csgo.", "2019 was fraudulent anyway, Na'vi took the AWP away from him to sign washed Guardian.\n\n[Still put up these numbers while rifling lmfao](https://www.hltv.org/stats/players/7998/s1mple?startDate=2019-09-20&endDate=2019-12-21)", "But zywoo can’t surpass s1mple as the goat of GO whereas he can as time pasts in cs2. Winning the major wouldn’t now update him as the goat", "My point is that CS:GO and CS2 are essentially one entity. Most of ZywOo's prime years were spent in CS:GO, and he may only have two or three peak years left in CS2. You can't just erase the achievements he accomplished in CS:GO.", "[deleted]", "It’s more than stats. I have friends who have don’t even know what cs looks like but they know who S1mple is", "[deleted]"]}
{"post_id": "1ha1adi", "post_title": "NRG vs Sharks / Fragadelphia 18 - Grand Final / Post-Match Discussion", "post_body": "## [NRG](https://www.hltv.org//team/6673/nrg) [🇺🇸](#nrg-logo) [3-0](https://www.hltv.org/matches/2377969/nrg-vs-sharks-fragadelphia-18) [🇧🇷](#shark-logo) [Sharks](https://www.hltv.org//team/8113/sharks)   \n**Default:** 1-0  \n**Vertigo:** 13-8  \n**Inferno:** 13-4  \n**~~Ancient~~**  \n**~~Mirage~~**  \n\n\n &nbsp; \n\n  \n**Congratulations to NRG for winning Fragadelphia 18!**\n\n &nbsp; \n\n# Map picks:  \n| NRG | **MAP** | Sharks |  \n|:--------:|:--------:|:--------:|  \n| | [Dust2](#map-dust2) | **X** |  \n| **X** | [Nuke](#map-nuke) | |  \n| | [Vertigo](#map-vertigo) | **✔** |  \n| **✔** | [Inferno](#map-inferno) | |  \n| | [Ancient](#map-ancient) | **✔** |  \n| **✔** | [Mirage](#map-mirage) | |  \n\n\n &nbsp; \n\n# Full Match Stats:  \nTeam | K-D | ADR | KAST | Rating  \n:--------|:--------:|:--------:|:--------:|:--------:  \n[🇺🇸](#nrg-logo) **NRG** |  \n[🇺🇸](#lang-us) [oSee](https://www.hltv.org//player/13249/osee) | 33-18 | 90.4 | 78.9% | 1.47 |   \n[🇨🇦](#lang-ca) [HexT](https://www.hltv.org//player/18838/hext) | 31-20 | 79.8 | 84.2% | 1.42 |   \n[🇺🇸](#lang-us) [nitr0](https://www.hltv.org//player/7687/nitr0) | 31-22 | 84.0 | 86.8% | 1.40 |   \n[🇺🇸](#lang-us) [Jeorge](https://www.hltv.org//player/20333/jeorge) | 27-22 | 90.7 | 86.8% | 1.37 |   \n[🇺🇸](#lang-us) [Brehze](https://www.hltv.org//player/9136/brehze) | 25-21 | 65.0 | 84.2% | 1.16 |   \n[🇧🇷](#shark-logo) **Sharks** |  \n[🇧🇷](#lang-br) [doc](https://www.hltv.org//player/22911/doc) | 33-31 | 92.2 | 73.7% | 1.15 |   \n[🇧🇷](#lang-br) [gafolo](https://www.hltv.org//player/20558/gafolo) | 19-28 | 60.7 | 65.8% | 0.75 |   \n[🇧🇷](#lang-br) [rdnzao](https://www.hltv.org//player/21921/rdnzao) | 19-30 | 50.7 | 63.2% | 0.66 |   \n[🇧🇷](#lang-br) [hoax](https://www.hltv.org//player/19991/hoax) | 13-30 | 48.5 | 57.9% | 0.59 |   \n[🇧🇷](#lang-br) [koala](https://www.hltv.org//player/21170/koala) | 19-29 | 50.5 | 50.0% | 0.57 |   \n\n\n &nbsp; \n\n# Individual Map Stats:  \n## Map 1: Vertigo  \n| Team | **CT** | **T** | Total |  \n|:--------|:--------:|:--------:|:--------:|  \n|[🇺🇸](#nrg-logo) **NRG** | 11 | 2 | 13 |  \n| | **T** | **CT** | |  \n|[🇧🇷](#shark-logo) **Sharks** | 1 | 7 | 8 |\n\n&nbsp;  \n\nTeam | K-D | ADR | KAST | Rating  \n:--------|:--------:|:--------:|:--------:|:--------:  \n[🇺🇸](#nrg-logo) **NRG** |  \n[🇺🇸](#lang-us) [nitr0](https://www.hltv.org//player/7687/nitr0) | 19-13 | 92.1 | 95.2% | 1.47 |   \n[🇺🇸](#lang-us) [oSee](https://www.hltv.org//player/13249/osee) | 19-12 | 92.6 | 71.4% | 1.44 |   \n[🇺🇸](#lang-us) [Brehze](https://www.hltv.org//player/9136/brehze) | 18-13 | 87.6 | 85.7% | 1.37 |   \n[🇺🇸](#lang-us) [Jeorge](https://www.hltv.org//player/20333/jeorge) | 14-13 | 86.7 | 81.0% | 1.22 |   \n[🇨🇦](#lang-ca) [HexT](https://www.hltv.org//player/18838/hext) | 14-13 | 70.2 | 81.0% | 1.20 |   \n[🇧🇷](#shark-logo) **Sharks** |  \n[🇧🇷](#lang-br) [doc](https://www.hltv.org//player/22911/doc) | 16-18 | 78.1 | 71.4% | 1.04 |   \n[🇧🇷](#lang-br) [gafolo](https://www.hltv.org//player/20558/gafolo) | 13-16 | 70.4 | 66.7% | 0.97 |   \n[🇧🇷](#lang-br) [rdnzao](https://www.hltv.org//player/21921/rdnzao) | 15-17 | 72.8 | 71.4% | 0.96 |   \n[🇧🇷](#lang-br) [hoax](https://www.hltv.org//player/19991/hoax) | 8-17 | 59.3 | 61.9% | 0.73 |   \n[🇧🇷](#lang-br) [koala](https://www.hltv.org//player/21170/koala) | 12-17 | 50.7 | 52.4% | 0.61 |   \n  \n## [Vertigo detailed stats](https://www.hltv.org/stats/matches/mapstatsid/189410/nrg-vs-sharks) and [VOD](https://www.twitch.tv/videos/2321666211?t=9h23m20s)  \n\n\n &nbsp; \n\n## Map 2: Inferno  \n| Team | **T** | **CT** | Total |  \n|:--------|:--------:|:--------:|:--------:|  \n|[🇺🇸](#nrg-logo) **NRG** | 9 | 4 | 13 |  \n| | **CT** | **T** | |  \n|[🇧🇷](#shark-logo) **Sharks** | 3 | 1 | 4 |\n\n&nbsp;  \n\nTeam | K-D | ADR | KAST | Rating  \n:--------|:--------:|:--------:|:--------:|:--------:  \n[🇺🇸](#nrg-logo) **NRG** |  \n[🇨🇦](#lang-ca) [HexT](https://www.hltv.org//player/18838/hext) | 17-7 | 91.6 | 88.2% | 1.76 |   \n[🇺🇸](#lang-us) [Jeorge](https://www.hltv.org//player/20333/jeorge) | 13-9 | 95.6 | 94.1% | 1.58 |   \n[🇺🇸](#lang-us) [oSee](https://www.hltv.org//player/13249/osee) | 14-6 | 87.7 | 88.2% | 1.57 |   \n[🇺🇸](#lang-us) [nitr0](https://www.hltv.org//player/7687/nitr0) | 12-9 | 74.0 | 76.5% | 1.33 |   \n[🇺🇸](#lang-us) [Brehze](https://www.hltv.org//player/9136/brehze) | 7-8 | 37.1 | 82.4% | 0.98 |   \n[🇧🇷](#shark-logo) **Sharks** |  \n[🇧🇷](#lang-br) [doc](https://www.hltv.org//player/22911/doc) | 17-13 | 109.5 | 76.5% | 1.30 |   \n[🇧🇷](#lang-br) [koala](https://www.hltv.org//player/21170/koala) | 7-12 | 50.2 | 47.1% | 0.55 |   \n[🇧🇷](#lang-br) [gafolo](https://www.hltv.org//player/20558/gafolo) | 6-12 | 48.7 | 64.7% | 0.54 |   \n[🇧🇷](#lang-br) [hoax](https://www.hltv.org//player/19991/hoax) | 5-13 | 35.1 | 52.9% | 0.45 |   \n[🇧🇷](#lang-br) [rdnzao](https://www.hltv.org//player/21921/rdnzao) | 4-13 | 23.5 | 52.9% | 0.38 |   \n  \n## [Inferno detailed stats](https://www.hltv.org/stats/matches/mapstatsid/189412/sharks-vs-nrg) and [VOD](https://www.twitch.tv/videos/2321666211?t=10h25m42s)  \n\n\n &nbsp; \n\n[**This thread was created by the Post-Match Team.**](https://postmatchteam.com/)  \nIf you want to share any feedback or have any concerns, please message u/CS2_PostMatchThreads.", "post_score": 170, "post_author": "CS2_PostMatchThreads", "post_created_utc": "2024-12-09 04:07:32", "comment_count": 22, "comments": ["This win straight up put NRG in #34 in Valve Rankings as of now lmao.", "NA 18 FRAGADELPHIAS  \nTHE REST OF THE WORLD 0", "Does autimatic not play for NRG anymore?", "NRG ERA \n\nnow?", "NRG is actually pretty legit.", "daps effect ", "[deleted]", "hopefully puts them close enough for an invite to Blast Bounty?", "Got replaced by Jeorge recently", "Look I've been an oSee defender forever but he's struggled a lot with consistency and I'm guessing confidence, I have a hard time seeing him as an upgrade over Hallzerk\n\nPut him in COL and I bet their awful team morale/confidence/the fact that they're not quite good enough overall to do well in T1 means he slumps all over again\n\nI'd like to see oSee succeed but I think he'd need to join a team with like rock-solid mental and structure", "also at this precise moment I'd say NRG is a better team to be on than CoL", "hallzerk is hardly the problem on col", "not even close, sorry pal. And BLAST has to use Valve Rankings from December 2nd for invites.\n\nAnd the only other method that they could've used is too restrictive at the moment (wildcard invites) as it only applies to teams that won a tier 1 event (MOUZ, G2, FaZe, NAVI, Spirit, and Vitality) or have a core of players that were originally and individually from teams ranked top 8 in Valve Rankings at any point in the past 12 months.\n\nIf you want an example, lets say Falcons and Cloud9 want to swipe a wildcard invite (both are eligible as they were ranked top 8 in early 2024 and are one step away from eligibility.). Falcons currently has Magisk and soon NiKo while Cloud9 has Boombl4 and Ax1Le. Both teams would need to acquire one more player that fulfills the requirement to be eligible, in which Falcons could hypothetically bring back SunPayus while C9 needs to acquire a player as Perfecto has no intention of returning. But because they're a Russian-speaking team, they're restricted to only players from VP, Spirit, or m0NESY.", "solid move", "Ah shit, didn't realize the cutoff was December 2nd. If it were later they would squeak into the top 32 since the fe teams wouldn't be attending. Makes sense, hopefully we see them get time in Europe in the future.", "Isn't the cutoff the [16th](https://blast.tv/cs/news/BLAST-premier-updated-format) even then they wouldn't be close enough because its the top 28 with another 4 from wildcards for the 32 total", "depends on how it looks, if they hold onto their top 40 Valve Rankings, they should be getting an auto invite to PGL Buenos Aires. But unfortunately that's also very close to EPL 21 so if they were to attend Buenos Aires, they have no time to rest and have to fly immediately to wherever in EU EPL 21 will be held in.", "well we'll see whether or not BLAST actually uses the wildcard invites. I wouldn't be surprised to see one used for Falcons assuming they sign all the top players they're hoping to over the break, but I'm not sure they'll be any other teams that'll be eligible for a wildcard invite.", "Thats a risk they are going to have to take tbh. they need to continue to get as many pts. daps said something about a european bootcamp so my guess is they go to PGL then straight to proleague and then bootcamp there", "Where are you sourcing this information? I'd like to check it out for myself, curious how this all works."]}
