{"post_id": "1hc195f", "post_title": "When it's the Major and not BB Dacha", "post_body": "N/A", "post_score": 3, "post_author": "mrasdfghj90", "post_created_utc": "2024-12-11 19:07:55", "comment_count": 1, "comments": ["Based magixx??"]}
{"post_id": "1hc0s56", "post_title": "Breaking: Perseverance League collapses amidst allegations of fraud", "post_body": "N/A", "post_score": 44, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-11 18:48:38", "comment_count": 10, "comments": ["I love my bearded man, but when fl0m is one of the most reliable TO's in NA there's a fucking problem", "just another day in NA", "One day NA will have a league that isn't ESEA and that league will survive longer than 2 seasons. We might all be dead by then, but surely it's bound to happen at some point", "Launders will save NA", "I wish something like CAL/CPL would come back.", "Just curious, what would other leagues offer that ESEA doesn't?", "I played in cal m in 1.3. I was a young scrappy kid and loved all the free time I had for scrims and matches. \n\nI wish I had time these days for some old man’s league", "Competition is inherently good, it makes every product in the space better. That, and in my opinion, the only way to make it pro in NA is by grinding your way up through ESEA league and hope you get noticed in Advanced/ECL. More leagues ideally means that more people are playing in leagues, so there are more places to foster and find talent in the region. That's the hope at least", "Me too! CAL-o Season 3 CAL-m Season 4! US East.\n\nLater on I played CAL-im/m in the West.", "I wish I remember our team name. Used to play on a server with a bunch of guys from Illinois. I was in NY. Another guy was in Toronto. Such good times. That server lead to a 13hr drive to my first lan where my mom wouldn’t let me take the computer. Smh mom"]}
{"post_id": "1hbzxd4", "post_title": "Team yelled at me that I baited them?", "post_body": "N/A", "post_score": 0, "post_author": "CThig_", "post_created_utc": "2024-12-11 18:13:24", "comment_count": 15, "comments": ["They didnt see what happened. You didnt bait anyone.", "Your team is just dumb", "There are 2 possible angles for you to have any kind of impact.  There are already teammates on those angles.\n\nWhat are you supposed to do?  Jump on their head?  Run in front of them?  Shoot through them?\n\nYour teammates are dumb.", "This isn't baiting obviously. But also baiting is not always a bad thing. It's often just seen as a selfish greedy player but can sometimes be used to win rounds. And you won the round. Nothing should be complained about here", "You weren’t there the second the retake fights happened but tbh that is their fault for not waiting \nYou traded anyway so kinda silly of a take", "Im guessing you didnt start rotating till extremely late?", "[deleted]", "U dont kno any of the info the pov or team had from that clip g", "Lmao I have over 7k hours but ok", "[deleted]", "its a joke lol chill out", "believe it or not, straight to ban", "Seems like you live quite a sad life if you get so much joy from making people angry. Get well soon", "YOU MADE ME SO ANGY ![gif](emote|free_emotes_pack|rage)\n\nIM GOOD PLAYER I SWEAR\n\nweirdo lmfao", "Ok mb"]}
{"post_id": "1hbyoh5", "post_title": "6Hours until pickem is locker, are you sure about your pick'ems? Who is winning full? Because I belive its time for some new major winner", "post_body": "N/A", "post_score": 0, "post_author": "Tomo258", "post_created_utc": "2024-12-11 17:22:03", "comment_count": 13, "comments": ["Feeling bold today, are we?", "Vitality.", "Ez for g2", "My exact pick also... gl us!", "Vitality to win easily, their form is insane.\n\nMongolz will take down Spirit no issues, their moment will make quick work of Spirit even with Donk.", "G0-2", "G-2 should’ve picked up Stewie post-Dallas, what they had was magical", "Lets go", "Mong lost vs Mouz haha", "Hell fucking no, he is so bad on an individual level", "Yea", "That... Just shouldnt be possible, thats like Real Madrid losing to Southampton in football. Unless Vitality makes to to Semi I wont get gold coin :(", "aura"]}
{"post_id": "1hbwyfq", "post_title": "Who had the hardest run to Major playoffs? By NER0cs", "post_body": "N/A", "post_score": 99, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-11 16:10:33", "comment_count": 16, "comments": ["ENCE 2019 in Katowice.\nWould've been THE best run ever, if they had won vs Astralis in the Grand Final.", "Always loving these comments that only refer to the title and not the linked article.\n\nI'm not saying it's wrong to discuss previous majors, if people want to do that then I'm all for it and maybe chip in the discussion myself, just pointing out you can clearly see how lazy people are with reading anything other than headlines.", "NIP this RMR", "G2 this year. And it isn’t close.", "c9's run was pretty good too although their semi-final oppenent played with a stand-in.", "Yeah that was straight fire!", "listen buddy I've got a narrative to push and don't have time to read anything over 12 words", "G2 made playoffs by beating a team ranked 6th, a team ranked 16th, and a team ranked 19th. The Mongolz made playoffs by beating a team ranked 2nd, a team ranked 5th, and a team ranked 7th. The best team that G2 beat is a single rank higher than the worst team  The Mongolz beat.", "and sk also had to play their quarterfinal and semifinal on the same day with only like a 3-hour break", "And people like to conveniently leave out that detail and pretend they beat the #1 team", "Apparently sarcasm doesn’t pass the test in this sub.", "Not to mention their match with Fnatic went to all 3 maps and several overtimes...", "Yeah they were on a roll with boltz. But still that SK core with any fifth is still a great team and they just had a year with felps so it wasn't any random standin. This is a team that took on fox and almost beat VP  in the semis of a major the year before.", "Sarcasm where?", "Yeah I'm with you there. I've seen so many people, a lot who I'm sure didn't watch the matches live, just cite the rankings of the teams cloud9 beat in the playoffs: #1, #2, and #5. Not that it wasn't impressive, but it's better to be objective about it.", "[deleted]", "Yeah. I remember that SK team yawning and looking tired in the C9 series. Don't get me wrong though, I think Cloud9 still win in 3 maps, tarik was going beast mode, and that C9 team did do well against SK. But I do wish they got to beat the full SK without any astericks."]}
{"post_id": "1hbvbye", "post_title": "Favorite storyline coming into the Major playoffs", "post_body": "Mine would be NiKo winning and than in the post game interview saying I'm not leaving and dropping the mic, that and the fact the snax could be the first person to win a major with a 10 year gap in between. I also love the fact that all 3 best players of the year are in playoffs and all 3 have a really promising chance to win the mvp which would 100% secure the #1 of the year.\n\nWhich would be your favorite storyline to play out in the playoffs?", "post_score": 108, "post_author": "dicksucker12369", "post_created_utc": "2024-12-11 14:59:26", "comment_count": 61, "comments": ["If we count cs 1.6 \"majors\" fnx won in 2006 and 2016.", "Mongolz fighting for asian CS in the first asian major", "The mouz NXT boys winning a major together before getting picked apart 💔", "Heroic could have an underestimated storyline; they could beat NaVi, G2, Vitality, and Spirit, so the entire top 4, all in a row to win it. Any combo in front of them would be legit af but especially this one.", "Mongolz miracle run to show that Asian CS can thrive internationally.", "G2 wins major , Niko runs onto the stage with the Falcons contract in his hand , and rips it apart in front of the camera. After that he signs a new G2 contract in front of the crowd", "All have some spice but the least interesting would be spirit and vitality. \n\nSpirit doesn't deserve a win with how it's just 2.5 players doing anything. I say that as a fan. Then winning would be a failure on all teams being unable to play good CS. \n\nVitality is textbook, best team shows up and performs. However, massive credit to Apex for a third win with different rosters each time. That would solidify him as an igl that knows how to use the tools they are given.\n\nFaze would be the retirement senior citizens showing up and further pushing karrigan as the best igl. They are following the same footsteps as old vp. Inconsistent but show up, just need one last hoorah. \n\nMongolz is the obvious miracle run like Boston. \n\nHeroic showing their worth by taking down all the top teams and the org building an entirely new roster after being poached to death. \n\nG2 finally give Niko a well deserved win. Snax showing he isn't just being carried (super impressed with their ancient terrorist hits)\n\nLiquid showing they aren't a fluke. Twistz proving his worth by leaving the best team, building his own, and winning a major. Giving liquid their first major. \n\nHonestly have no opinion on Mouz lol.", "G2 vs Spirit in the finals for sure. To me the best scenario is G2 winning close series, but MVP goes to donk. Not only that means the best swan song possible for NiKo, it also is a huge comeback for Snax and deserved win for Malbs and M0nesy. And MVP for donk in this case would be the first Major MVP in history for the player who didn't win the tournament itself", "Mongolz would be interesting but G2 in the final would bring so many watchable moments. Hopefully against spirit so we can seal the discussion for 2024.\n\nI also would love the see faze win and karrigan retire on the pedestal he deserves", "MONGOlz are sick but I feel they will get DONKed. \n\nBest storyline is g2 vs spirit. \n\nG2 loses the first map but somehow get into 11-11 situation with Niko flanking with a DEAGLE. \n\nDonk goes down with a single shot to the back of the head. \n\nThird map is 13-1 niko show", "Team spirit beating G2 with an incredible donk performance and breaking G2's 5 match streak by beating spirit in the most important match between them \n\nDonk mvp, rookie of the year and #1 in the HLTV world - fucking history.", "Spirit losing out on finals with donk dropping 1.5+ and snatching that #1", "I personally have a Team Liquid vs Faze final for my picks. Fan of both teams and the storyline is there considering Twistzz is former Faze and Liquid has had a tough record against Faze, including the choke earlier in the year. Hoping TL beats Faze out in the unlikely chance they meet each other there.", "NiKo loses his last chance at winning and goes to valorant. Mongolz take the first W for asian CS. Yes Im a NiKo hatemaxxer.", "I want either Mongolz or G2 to win.", ">all three best players are in the playoffs.\n\nWhat are you on about? VP never made playoffs...", "Where to begin... NiKo possibly getting the dub being G2's swan song. Apex getting one more before spinx leaving, MONGOLZ BAYBE, Heroic's redemption arc after imploding, Twistzz proving to be a worthy IGL and Ig FaZe winning the whole thing to redeem themselves\n\nLast one will never happen tho", "r/rimjob_steve", "lmao that first one is absolute cope and im here for it", "donk having the best individual performance of all time at the majors if he manages to beat both g2 and mouz, his kryptonites, in a rather dominant fashion"]}
{"post_id": "1hbr57g", "post_title": "A sneak peak of tomorrow playoffs stage ", "post_body": "N/A", "post_score": 1849, "post_author": "InternetAnon94", "post_created_utc": "2024-12-11 11:09:36", "comment_count": 93, "comments": ["I love 360° stages so much, I wish more events were doing it.", "If the crowd is as good as the group stage, alongside such a stacked list of teams, this is probably going to be one of the best major playoffs I've watched since I got into CS esports in 2018 because this arena set up is amazing", "[Source here](https://weibo.com/5057286913/P4nKQujLX?refer_flag=1001030103_). \n\nCan't wait for the players walk-on", "Wow", "8am perfect time to watch at work", "Looks amazing", "Gives me Boston 2018 vibes", "Hopefully it's sold out and bloody rowdy", "Looks mega tbh", "My legs would give out from nervousness if I were on that stage lol", "Now that is a proper \"cage\" stage.", "So nice! The whole production is on a such high level im jealous... PGL CPH was so boring and ugly compared to this and the merch.", "holy fuck that is so sick!!!!!!!!!!!!!!! \n\nthe players must be fucking AMPED to play in there!", "Niceeee, China go big as always", "Now i wanna wake up 1:00am at night to watch these games UGHHH", "This is gonna be so sick", "Boston 2018 vibes \n\n  \n[https://tenor.com/pl/view/csgo-tarik-arm-flapping-cloud-9-stabilized-gif-8871173057993016235](https://tenor.com/pl/view/csgo-tarik-arm-flapping-cloud-9-stabilized-gif-8871173057993016235)", "Welp Mouz 0-2 then", "This setup really amps up the atmosphere. Can't wait to see how the players handle the pressure with the crowd so close. It’s a whole new level of intensity that could lead to some unforgettable moments.", "peek\\*"]}
{"post_id": "1hbpg61", "post_title": "Jame's comment on what's next after Shanghai Major(VP vlog)", "post_body": "With the news of VP benching Jame I'm posting this to provide more info surrounding Jame and VP. This was after they were eliminated from Shanghai major(opening stage)  \nCLICK HERE(timestamp 13m30s, EN SUBTITLES) -> [VP VLOG](https://www.youtube.com/watch?v=x37nwC6J5RU&t=810s&ab_channel=Virtus.pr%D0%BECS2&t=13m30s)\n\nFOR THOSE WHO DON'T WANT TO WATCH I WROTE IT DOWN:\n\n\\- What's next? It's unknown. We'll think. Nobody is satisfied. There are no people in the team who are ready to lose stealing paychecks. Every player is ready to leave if we don't create optimal conditions for him. If you don't create optimal conditions for every player, they won't want to be in the team.\n\nI think, currently, everyone is ready for any outcome and ready to both change and accept the neccessity to leave.\n\n(question to Jame) - Are you ready for this? -Yes, naturally. It's time to think and reconsider everything. To move on.  \nI don't know yet-, I mean I have two ways - Either I stay, or I don't stay. That's, like, the extremes. If I stay - in what role? The captain? Not the captain? The sniper? Not the sniper. A player, not a player? Perhaps, the coach? I don't know, maybe, I should consider media(youtube,twitch etc.) or just take a break.\n\nIf I don't stay, where do I leave? Do I want to continue? How do I want to continue? Where do I want to continue? Do I want to take a break? Do I want to work in the academy as a coach/player/sniper/captain? There's a lot of options. Or be a media guy(streaming etc.) Or just retire from esports for some time(long break) I gotta think through all this. Am I ready? Do I want to? Do I enjoy it? Or do I just have to work on my health? Perhaps I'm not as passionate about this game as before? Perhaps I'm just tormenting myself? Tormenting my enviroment?", "post_score": 288, "post_author": "JAME_IS_MY_GOD", "post_created_utc": "2024-12-11 09:02:03", "comment_count": 30, "comments": ["It seems he became a fucking philosopher", "Born too late to be a philosopher. Born too early to navigate the moral dilemmas of humanity’s expansion into space. Born just in time to save the AWP in palace.", "Bro had more questions than the interviewer", "Jame is not saving questions on that interview", "Jame channeling his inner Master Oogway for that", "tldr he doesnt know", "This team lost the only part of its identity", "I'm here for the JAME redemption arc where he gets on a new team and beats VP in the 2-2 game to qualify for the major", "I'd love to see him do more on YouTube if he's really going to leave competition, and I imagine he would do great as a russian language costreamer. Deep guy & 5head", "I think this is a colossal blunder by VP. I get that they aren't good enough, but Jame is the one irreplaceable piece of this team. With four faceit stars acting as the fingers of his hand, he won a major and earned event MVP. The other great IGLs of this era that won a major (karrigan, aleksib, apex) had far less individual impact, and far more talent on the roster. We can make jokes all day about Jame being slow or boring, but the magnitude of leading his squad to a major title in Rio, cannot be overstated. Add to this the run VP had as a top 10 team. Jame is elite.\n\nVP will not be able to recover from this. They have no pieces worth building around. Players that can be part of a successful roster, yes. But championship teams are always built around superstar talents, and VP just benched theirs.\n\nAs a fan, I hope Jame goes to Spirit. He can IGL, anchor, secondary AWP, and clutch. I would replace two of chopper, magixx, and zont1x with Jame and kyosuke. Spirit rarely reaches outside their organization for players, but they did it when sh1ro became available. An international project might be cool too. Wherever he goes, I hope Dastan goes with him", "Great vlog (the entire thing), very humanizing. There's also a [goodbye video](https://www.youtube.com/watch?v=RA-DsfK6pGg) posted by VP. He has a lot to think about like he says in the vlog, including whether he's still got enough passion for the game and will continue playing. I hope it's not the last we've seen of him as a player in a top org.", "Jame is hilarious", "it doesn't look like he is taking it well.", "It's way too much work to awp and run a team if ur team is not 100% on the same page with you, working fluently.", "He has always been", "He definitely let the post nut clarity do the interviewing", "That's my goat", "The interviewer became the interviewee hahah", "He saved so many questions over time, they finally all come out.", "he doesn't, but it is waay too funny listening him question reality n shit"]}
{"post_id": "1hbo8da", "post_title": "Intro guide for non-players to watch competitive play?", "post_body": "Can someone recommend a video/explanation out there that I can send to a non-gamer in order to provide context so that person can watch a tournament broadcast and understand the basics of what is going on? \n\nI've found several good beginners guides that discuss how to *play* the game as a total noob, but those seem to mostly revolve more around learning how to shoot, suggestions on how to practice, how to use comms, what settings to choose, etc. Which is much less helpful for someone who just wants to learn to watch the game.", "post_score": 1, "post_author": "Oops_All_Spiders", "post_created_utc": "2024-12-11 07:27:39", "comment_count": 7, "comments": ["This gives a basic understanding of cs. The only thing outdated is it describes MR15 rather than MR12 https://youtu.be/13VdzfBq3FA?si=_ElLhFDHZVnTL3nX\n\nThis video also gives a good understanding, just skip to around 1:27 https://youtu.be/KDYem3j3wGY?si=m7pxlrU0wHhp28rv", "This game isnt like DoTA or StarCraft where you need some game knowledge to understand what is going on in a match, it is pretty straightforward, people shoot each other and try not to die, moving around the map to take control and go for elimination or the bomb objective, some utilities but nothing crazy like valorant or overwatch character skills.", "There isn't much you need to \"know\" \n\n\nI'll recommend watching it in game you control the camer or you can use the observers view also there is in game commentry.", "The one from CS ghost animation. Short and to the point", "you dont really need to know much about the game to watch it", "Seriously, just tell them to watch the game. CS is fundamentally very simple", "Thank you for giving an actual answer!"]}
