{"post_id": "1h62128", "post_title": "Are viewer passes only worth it if you pay attention to the competitive scene?", "post_body": "I don't have any interest in watching pro games and as a result, I've never paid attention to viewer passes.\n\nThe coin this year is pretty cool though.\n\nIt looks Valve ties coin progression to creating brackets for pro games instead of actual in-game missions, which drives the majority of casuals away like myself. \n\nI couldn't name a single current player on any pro team and thus have no chance of successfully picking winners.\n\nAs a casual, are these viewer passes just meant for those who pay close attention to the pro scene?\n\nThanks", "post_score": 0, "post_author": "HilltopHood", "post_created_utc": "2024-12-03 23:49:23", "comment_count": 10, "comments": [">It looks Valve ties coin progression to creating brackets for pro games instead of actual in-game missions, which drives the majority of casuals away like myself.\n\nYou are conflating two different \"events\". Operations and Majors.\n\nThe viewerpass is a thing for every CS-Major (2x per year). It is specifically about esports and essentially just a way for valve to cash in on the whole sports betting thing.\n\nOperations are an entirely different event, not seen for a number of years now, where Valve add a bunch of more or less custom mission, special gamemodes, progression systems, skins and other content to the game. There you'd buy an operation pass, that would let you get drops. So like the armory pass, but with actual content that isn't *just* skins.", "It's called a viewer pass for a reason my man.", "\\> It looks Valve ties coin progression to creating brackets for pro games instead of actual in-game missions, which drives the majority of casuals away like myself.\n\n  \nTo be fair the last time Valve tried to create 'in-game missions' style it caused all dust 2 games to be a 'run down mid with molly and grenade' lol", "If you want the coin you need the pass.\n\nIf you don’t care about watching games then just copy Bleh’s picks. He’s pretty much always the best at it.", "Don’t buy it if you don’t watch pro play. If you have some form of fomo for the coin, just buy it. There’s a randomize button to pick for you if you don’t care about it too", "I think it's fun to show off your coins with friends. Our group is a casual group and I'm the only one who watches the games on a daily basis, but since the majors started we've all bought viewing passes and enjoy watching the games.", "Yes. It is a viewer pass and not an operation pass.", ">It looks Valve ties coin progression to creating brackets for pro games instead of actual in-game missions, which drives the majority of casuals away like myself.\n\nAs others already said, this is not an operation. Its a major, the most prestigious CS2 Tournament there is. This isnt about the game or about content for casuals, its about the esports scene.  \n\n>As a casual, are these viewer passes just meant for those who pay close attention to the pro scene?\n\nDepends. Coins like the one you get from viewer passes are a collectible, some people like myself are intrested in pins, coins and other collectibles. If you enjoy the collectible aspect as a casual then the major is for you.\n\notherwise, it is most interesting if you enjoy the esports scene.", "You get the coin, do some betting and can end up with a few free cases.  \nIf that's worth it to you buy it, otherwise don't.  \nI don't follow the scene either, usually just watch the final and make my picks based on whatever people are posting here.", "is he? or are you saying that because he was best the very few last times"]}
{"post_id": "1h5n1uj", "post_title": "From Ivy, Out Middle, Through our Connector like a M4A1-S Speed Demon! Our new skin, Featuring a Translucent magazine :D", "post_body": "N/A", "post_score": 136, "post_author": "SirYuwi", "post_created_utc": "2024-12-03 13:11:01", "comment_count": 17, "comments": ["Admin, he's doing it sideways", "Sheesh M4 bussin", "Here is the workshop links & let me know what you think!! :\n\nMidnight [https://steamcommunity.com/sharedfiles/filedetails/?id=3376598623](https://steamcommunity.com/sharedfiles/filedetails/?id=3376598623)  \nFire [https://steamcommunity.com/sharedfiles/filedetails/?id=3376593182](https://steamcommunity.com/sharedfiles/filedetails/?id=3376593182)  \nBlue [https://steamcommunity.com/sharedfiles/filedetails/?id=3376588968](https://steamcommunity.com/sharedfiles/filedetails/?id=3376588968)", "Beautiful !! would buy in a heartbeat", "what are u shooting with the m4? the mag is filled with 50cal bullets damn", "i have zero clue if its possible, but it would be way cool if you could tie the skin color to the wear (blue fac new, red battle scarred type beat).\n\n if something like that isn't possible then having it be pattern based for diff colors could be cool too.", "Why are there so few cartridges tho? Thats not at all how a 556 mag would look like :D\n\n[https://magpul.com/media/catalog/product/cache/ec95e45c18f9ea74c3e5ae88faf4ee5c/m/a/mag1417-odt\\_magpul\\_tmag\\_30\\_ar\\_m4\\_gen\\_m3\\_05\\_1.jpg](https://magpul.com/media/catalog/product/cache/ec95e45c18f9ea74c3e5ae88faf4ee5c/m/a/mag1417-odt_magpul_tmag_30_ar_m4_gen_m3_05_1.jpg)", "i despise all translucent magazines because they arent real, is this any different?\n\n  \nyou seem to have posted screenshots that would suggest they are, which is very misleading", "I wish translucent mags actually showed the right amount of bullets in a mag but that will probably never happen.", "bullets too big and it's a furry skin not a bhop skin", "Glad you think so! :D", "such kind words! thank you :D", "Only included 20 bullets as it's how many there is in-game :D Here's a look of just the mag : [https://i.imgur.com/yCgMAFD.png](https://i.imgur.com/yCgMAFD.png)", "It is in fact translucent, I found a method to achieve an effect similar to how it would be like in real life. Took a while to accomplish.\n\n**Edit**, Here is the magazine in action: [https://i.imgur.com/vwA7RMj.gif](https://i.imgur.com/vwA7RMj.gif)", "Yeah but that magazine fits 30.  I would have gone with realistic visuals over abiding to the game balanace changes. Either way its not like these bullets get used up as you fire, right?\n\nThey just look comically large to me like that.\n\nCool visuals still.", "If that is translucent, I would love to see it ingame"]}
