{"post_id": "1h60uq1", "post_title": "Which areas are no longer accessible after the Palais update?", "post_body": "[https://steamcommunity.com/sharedfiles/filedetails/changelog/3257582863](https://steamcommunity.com/sharedfiles/filedetails/changelog/3257582863)\n\n>\"Clipping improvements\"", "post_score": 3, "post_author": "Weetile", "post_created_utc": "2024-12-03 22:58:05", "comment_count": 3, "comments": ["Run boost outside the map = no no\nCan’t stand on door frames anymore\nCan’t climb on ivy\nI didn’t remove the solo boost to the garbage box at bombsite and to the umbrella at CT though\nThanks for asking, will mention it in the patch note", "One more question -- did you fix the bomb getting stuck under the chair/table in the lobby?", "Nop, didn’t know about this one. Thank you, will have a look"]}
{"post_id": "1h60gh5", "post_title": "New heaven changes on Overpass (@TravCS on X)", "post_body": "N/A", "post_score": 388, "post_author": "SpeaRofficial", "post_created_utc": "2024-12-03 22:40:44", "comment_count": 14, "comments": ["So no ledge angle or deep stairs angle anymore? Probably good change for casual playerbase, since long distance angles with multiple elevations aren't generally fun to deal with. Not that big of a change for potential pro play", "looks good railing was always awkward with shit visibility", "Usp goes sick with your gloves and stickers man", "good change now remove vertigo for overpass", "We need this map back in the roster, Dust is awfully balanced, vertigo is shit, and mirage is old af", "Lowkey flexing the skins, i see you 👀. I also got the usp printstream and gamma m9. Mines a phase 3 tho", "Its been 10 years and I still get lost on Overpass ![img](emote|t5_2sqho|31253)", "Exactly my thoughts. Seems like a visibility upgrade and pushes players to commit more, insted of playing passive defence. Plus you have the best maps pin, so I have to agree with you anyway.", "nothing is fun about overpass", "Yeah th. Really didn’t care about glove-gun combo’s but this one is neat", "Thank you! I've had it since 2018 at this point, too good to sell", "GOAT map with Mirage and Ancient", "d2 office and italy are the goat maps of cs"]}
{"post_id": "1h5yiu8", "post_title": "Counter-Strike 2 Update (2024-12-03)", "post_body": "N/A", "post_score": 706, "post_author": "walk3", "post_created_utc": "2024-12-03 21:20:43", "comment_count": 143, "comments": ["> Added r_allow_low_gpu_memory_mode setting to allow running CS2 Workshop Tools in low memory GPU conditions.\n\n[That's a lie, its called `r_allow_low_gpu_memory_mdoe`](https://github.com/SteamDatabase/GameTracking-CS2/compare/5d38970d438b...270b70cc77a3#diff-4f3382827247e6a1bb456ed70549202bcb5c5c2f016e84fae3ced86f348afda9)", "With this many recent changes on Overpass, I've got a feeling that its coming back after the major. (Probably alongside Train? Is a 2 map rotation really happening?)", "**[ SHANGHAI MAJOR ]**\n\n\n*  Updated MIBR player sticker items autographed by Lucaozy with the autographs of brnz4n.\n\n*  Fixed a UI bug that allowed dropping Pick'Em team logos outside of Major Pick'Em hub using both mouse buttons.\n\n*  Pick'Em challenge picks can now be placed for the upcoming Elimination Stage of Shanghai Major.\n\n\n\n**[ DAMAGE PREDICTION ]**\n\n\n*  Predicted ragdolls without a confirmation or correction from the server within a short time window will now revert.\n\n\n\n**[ MAPS ]**\n\n\n\n\nTrain\n\n\n\n*  Increased collision fidelity of several models\n\n\n\nOverpass\n\n\n*  Replaced railing inside Heaven with a wall\n\n*  Additional visibility improvements in Heaven\n\n\n\nEdin\n\n\n*  Updated to the latest version from the Community Workshop ([Update Notes](https://steamcommunity.com/sharedfiles/filedetails/changelog/3328169568))\n\n\n\nPalais\n\n\n*  Updated to the latest version from the Community Workshop ([Update Notes](https://steamcommunity.com/sharedfiles/filedetails/changelog/3257582863))\n\n\n\n\n**[ MISC ]**\n\n\n*  Fixed 'boost player contrast' visibility rendering option sometimes revealing parts of players or weapons through thin surfaces.\n\n*  Added r_allow_low_gpu_memory_mode setting to allow running CS2 Workshop Tools in low memory GPU conditions.\n\n*  Fixed various bugs in Hammer.\n\n[Counter-Strike.net](https://www.counter-strike.net/newsentry/4472733036435211443) | [Steam event](https://store.steampowered.com/news/app/730/view/4472733036435211443)", "[that's the new overpass heaven wall](https://i.imgur.com/PyPaLcF.png)", "[ DAMAGE PREDICTION ]\n\nPredicted ragdolls without a confirmation or correction from the server within a short time window will now revert.\n\nIts getting better", "Not home rn, how many hours left are there since right now to place pickems?", "Are they ever gonna fix the frame-pacing and micro-stutter. My 1% lows are consistently terrible.", "Visual improvement for overpass? Coming back?", "i got banned on faceit because of this update lmao", "Wz", "Also perfecto(c9) and afro(fnatic)stickers added", "When is season 2 dropping? Lol", "Fix ranking system your season 1 was clusterfuck.", "Can we get anti cheat?", "Since update 03/12 ind CS 2, i have very fps drop.\n\nDoes anyone else know how to solve it?", "The game still feels like shit even on 300+ fps.\n\n  \nBack to valorant again.", "I'm surprised more people aren't butthurt about the Lucaozy autograph change.\n\nImagine you're buying $0.99 USD capsules chasing autos from your favorite players (maybe to be the first to make a craft), and now those autos are replaced, whether unapplied in your inventory/storage, or on a craft.\n\nEven if you don't care about the major, the player, or stickers...this is a shitty thing for Valve to do.\n\nEdit: I also feel like people don't care as much because it's Lucaozy...but imagine if it was donk, ropz, zywoo, jL, etc", "This is the update we were waiting for. Game saved.", "guess what, valve find the solutions to the game in 2024 with new devs like its early 2000, by the community. must be great to do not work and just w8 for the solution..\n\n[https://x.com/ZooL\\_Smith/status/1858555121912684851](https://x.com/ZooL_Smith/status/1858555121912684851)", "Kkk"]}
{"post_id": "1h5kip6", "post_title": "I got 5 predictions right but i can’t upgrade, am i missing something lol", "post_body": "N/A", "post_score": 0, "post_author": "bro-guy", "post_created_utc": "2024-12-03 10:32:47", "comment_count": 10, "comments": ["All matches in the current stage has to conclude before proceeding in the pickems. Just wait a bit and you'll get the upgrade :)", "Wildcard vs Passion UA is still live. It will get upgraded once the opening stage concludes", "There is still a live match going on. Just wait till after.", "its not yet updated", "Yes, the timing.", "[deleted]", "Current stage is still *technically* ongoing. It’s the same every major dudes, take it easy and enjoy the matches", "Ohh okay thanks, im watching it rn :)", "Hahaha yeah", "Diamond coin fr 🥶🤙", "This is my first time playing picks, i thought that you had an upgrade the moment you reached x predictions but apparently im wrong"]}
