{"post_id": "1ha6siv", "post_title": "How would CS change if there were 9 maps in the tournament map pool?", "post_body": "Purely hypothetically, what impact would expanding the tournament map pool to 9 have on the esports scene? Purely theoretically it is doable soon +Train +Cache. ", "post_score": 0, "post_author": "Perakk", "post_created_utc": "2024-12-09 10:27:16", "comment_count": 9, "comments": ["More messy CS since it takes a lot of time to master wider map pool. BO3s could also be more coinflips and bans could be shifting between 2 maps. BO5s would be more fun, but would also definitely spark discussion of introducing BO7s in tournament finals. \n\nOverall I'm not a fan of the idea.", "I think the quality of CS would go down. Either you wouldn't be as polished on all the maps as you'd want to be (aka spread too thin), or you'd focus on a portion of the maps and therefore fall short on the others. \n\nAlso in the end it probably just adds a 2nd perma ban to each team in a bo3 situation which just kind of kills it in practice.", "Generally lower quality games from tactical standpoint. Teams would have less time to hone down their defaults per map, which either leads to more gimmick strats being used or lower quality defaults.\n\nMore upsets. Bigger map pool incentives especially lower ranked teams to become specialists in 1 or 2 maps to generate as much upset potential as possible.\n\nWe could potentially see more different ideologies from teams (execute-heavy teams vs. map control/default). Maps like Train, Mirage, Cobble and Cache would be favored among execute-heavy teams etc. This has arguably been missing from professional CS for a few years now. \n\nWhen I think about it, I'm not sure how picks and bans would go. Right now its Ban, Ban, Pick, Pick, Ban, Ban, Pick. Would teams get two bans in first or second phase?\n\nBO1's should be abolished from every competition. It's arguable that they shouldn't be a thing even now and the map pool of 9 would make that even more apparent.", "For the worse - quality would go down and there would be more burnout due to the players having to prep more maps.", "Just adds one more permaban per team", "Bo1s is sort of needed in tournaments. In the Major, for example, you have 8 games in the first round. Split them out across 2 streams, and you are looking at 12 maps of CS, which probably takes comes out to 12 hours of game time. Factoring in tech delays and breaks between maps and games, and it could easily run 15 hours, or 10 in the morning to 1 in the night. That seems unfair to me. And I don't know if running 3 streams makes sense financially", ">Maps like Train, Mirage, Cobble and Cache would be favored among execute-heavy teams etc. This has arguably been missing from professional CS for a few years now.\n\nThis has been missing from pro cs because you just don't play exec heavy playbooks with how unpredictable rounds go, you can't expect every little detail and have a set protocol for everything. It's not map dependant, it's just the current meta, \"executes-heavy teams\" are a thing of past.\n\nBesides, we have no idea how train and especially cbble or cache would play out on pro level. I'd even argue your split into default- and execute-heavy teams would suggest all of these to be default-heavy anyway.", "I think when most people advocate for the removal of bo1s they are also advocating for a format change to account for that"]}
