{"post_id": "1hb090u", "post_title": "Changes since 1.5 years ago", "post_body": "I just took a look at the bracket of [Pro League S17](https://www.hltv.org/events/6862/esl-pro-league-season-17), which was roughly 1.5 years ago, and realized how much indirect CS history is in that bracket:\n\nEU\n\n- VP was still Outsiders and Kairon was on the team\n- Shiro and Nafany (and Hobbit) played on Cloud9\n- s1mple, Electronic, and Perfecto were all on NaVi\n- ENCE was ENCE\n- frozen, JDC, and dexter were on MOUZ\n- Twistzz was on FaZe\n- mezii was on fnatic\n- jks and hooxi were on G2\n- not seen in the bracket - NBK, KennyS, and misutaa were on Falcons (which had a full French roster)\n- Aleksib and headtr1ck was on NiP\n- w0nderful was on Spirit (donk and zontix still in the academy), as was Patsi and s1ren\n- flamez and degster were in OG\n- Xyp9x, gla1ve, BlameF, and Buzz were on Astralis\n- Magisk and dupreeh were on Vitality\n- Cadian and stabbi were on Heroic\n\nAM\n\n- Fallen and chelo were on Imperial\n- nitr0 and oSee were on Liquid\n- skullz was on paiN\n- EG existed\n\nRest\n\n- not seen in the bracket - Mongolz didn't effectively exist in this roster yet (Blitz and Techno were part of IHC whose entire roster joined The Mongolz in April, and 2 months later was 4/5 of the current roster)\n- CS was GO and mr15\n- Eternal Fire logo was blue\n\nCrazy how much the rosters have changed in such a short time, and many players didn't just switch teams once but multiple times and/or took a break. If we take a look at [the ranking at the time](https://www.hltv.org/ranking/teams/2023/march/13), FaZe is the only top10 team to not have gone undergone major changes (players only) since then, only changing Twistzz and in fact they've mostly stayed the same for the last 3 years. The rest of top10 has swapped an average of 3.0 players since then. Don't know how it compares to other years but it sure feels crazy volatile looking back.\n\n// edit - the title was a working title but I've forgotten to change it and now it's a bad title\n\n// edit 2 - some corrections based on comments", "post_score": 113, "post_author": "Gigusx", "post_created_utc": "2024-12-10 12:04:21", "comment_count": 19, "comments": ["The Mongolz were formed when IHC dropped them. So blitz and techno were on the roster.", "dupreeh wasn't benched, He was away welcoming his baby, just like mezii this year at Blast Singapore, He even joined back the team for playoffs at this event, the only matches he missed was the group stage", "EF LOGO WAS BLUE?!?!?", "Why was magisk benched?", "\"EG existed\" made me lol at first and then smack my forehead really hard. We really need to learn from that fiasco!", "I remember it so vividly, CS2 was announced in the middle of G2/Ence playoff match. Everyone was so hyped all the chat was just talking about this, casters sounded completely distracted and I couldn't give a shit G2 got brutally eliminated at that time. Niko made a Vlog afterwards showing he and Monesy were just watching the trailers during the map break, they weren't even focusing at all.", "Cool stats, I love esports history facts, so always appreciate posts like these!", "Thats crazy. So much in such little time.", "can't believe headtr1ck still has a job lol he's garbage", "Good catch! Fixed now", "Thanks, I forgot the context of what happened. Now that I look at it his break and Pro League don't even overlap so I just removed it 👍", "Uh huh! 😁 https://logos.fandom.com/wiki/Eternal_Fire", "r/retconned", "He is not, and so is dupreeh,", "Dupreeh was benched, not Magisk.", "looks too much like c9 imo\n\ni wonder if that prompted the change", "dupreeh wasn't benched, he was only away welcoming his baby like Mezii this year at Blast Singapore, [He was back with the team for the playoffs](https://www.hltv.org/matches/2362242/vitality-vs-ence-esl-pro-league-season-17), he only missed the group stage of this epl", "I honestly don't even remember EF's ever being blue haha. When I saw it at first I thought I'm looking at the C9 logo."]}
