{"post_id": "1h2jk5e", "post_title": "WarmupServer DM now with improved client performance (and additional FPS-Boost)", "post_body": "With this update we're focusing mainly on client performance. This means we were heavily investigating how to reduce the work your client has to do. And the result of this got released yesterday!\n\nI'm hope it's fine to present and discuss this update here in reddit with you.\n\nYou all know about the console spam in deathmatch. This is reduced by 99% and it's not a fake. These messages are coming from your client and not seeing them means that your client is not doing the related actions. But there are more things we've improved compared to our last version. All these things are already improving the FPS a little and the feeling a lot.\n\nBut the most insane improvement is our additional FPS Boost. It's only available if you have Boost Player Contrast deactivated (r\\_player\\_visibility\\_mode = 0). With this setting being deactivated we're able to hide a lot of useless things for you like models that are not visible to you.\n\nWe're pretty open with the things we're doing in this update although knowing it might be copied. One reason for this is that there are recently people out there spreading misinformation about WarmupServer. The core network communictation of CS2 is of course the same and remains untouched. All optimizations running on WarmupServer are focusing on reducing the information send to the client (and of course avoiding high server frames).\n\nDon't quote me on this but regarding my tests with Vprof there are improvements in Avg and P1 of round about 20%-35% from playing the new version with FPS Boost against playing it without. So an example for the improvements would be P1 = 100 --> 120 and an Average FPS of Avg = 180 --> 230. Could be more or less depending on your system. Would be nice if you test it yourself: **There is a FPS measuring tool included in the CS2 console called \\[VProf\\] which calculates a lot of FPS things after each disconnect.** Just scroll up! Wanna share your measurements? In this case please, pay attention to the player count on the server. With each filled up slot the client has more to do and the correlation is not only linear.\n\nFurther things added into this update:\n\n* There has been added further content like our Logos on the wall which we currently only shows to you if you want to use our FPS-Boost.\n* We've added our own MultiCFG sounds like it was on CS:GO.\n* On some servers a new Spawnsystem is running. Further optimization are coming for this system. Detailed premium feedback is welcome. It's not the final version.\n* We added de\\_train which should be a great map for deathamtch now. Insane job from the mapper. Absolutely sure we're having a lot of fun with this map. Therefore we set this one up. More maps maybe soon if there is interest.\n* We added more EU locations like Warsaw and Amsterdam\n\n Thanks for reading and maybe your opinion in advance.", "post_score": 57, "post_author": "DanielSensenbringer", "post_created_utc": "2024-11-29 11:11:50", "comment_count": 20, "comments": ["[deleted]", "I'll give it a shot. I left warmsup server for pracc forever ago.", "Can you please disable the message on the server for these commands after some time? Now I can't see which mode is being played and for how long.", "It would be nice if you could post some short information somewhere on the front page of your website. When I was prompted to download stuff when joining one of your servers my first thought is that this is a bad thing. I went to your website and couldn’t find a single thing about it, only heightening my suspicion on this being malicious.", "Love warm-up server. Keep it up", "If any server goes above 14-16 player slots the server starts to have seizures.. most of the multicfg servers have 20 slots... how do ppl play on those servers without loosing their mind i have no idea.", "I wish faceit would add similar features\n\nplaying on 3rd party DM servers on the fps versions of maps is so much more fluid than a 5v5 match sadly.", "For me since you introduced this fps boost feature, anytime I join a server the game crashes a few seconds later, does not happen in any other DM server and I haven't touched any settings with my game lately.", "Feels like a bit too little too late for WaSe, used to always play on there but the cybershoke servers feel a bit better for me and also have more options eg. Retakes, exec and more players. Are there any benefits to WaSe? (Not a rant, just curious to other opinions)", "The console messages don't directly do but there are things being done by your client that causes these messages. However this improvement isn't increasing the FPS much compared to the FPS Boost. We still added this feature as the feeling was still much nicer with it.", "there should be a command for it... not sure right now...  at least could be added soon.", "this is pretty much the norm for community servers, workshop downloads are perfectly fine", "Yeah, there should be some info. I just added some text infos to it. Pretty basic... video of all of this shit would be a way better presentation. Anyone? dm me...", "sounds like you have not tested our new fps boost... there are as well smaller servers. but the servers should be running fine for you and way better than other 16 slot dm servers.", "the problem with Cybershoke is that their servers are pretty much always empty if you’re anywhere except Scandinavia or Russia because everyone congregates on the high-ping Moscow servers\n\nWASE had better bots IMO and allows you to go through a full warmup in a matter of like 30 mins whereas on Xplay and Cybershoke you have to jump to a different server\n\nthey’re also the only ones that have decently full DM servers at all times in Europe\n\nalso, they don’t try to shove fucking skins down your throat like Cybershoke", "I just have to ask, why are your servers so big? So 24 players. Less than 30-40% of the time you have a duel with someone who is also looking at you, otherwise you kill someone from behind or get killed from behind. That's why spawns are so bad, someone can kill me twice in a row without my weapon being ready. That takes away a lot of fun and happens in each session multiple times.\n\nDoes this simply have to do with the maintenance costs of the servers or why do you do this?", "It’s not the content that is important in this context, but it’s the ability to verify that what I’m about to download is legit. If I go to your website and see that you have just pushed a new update to your servers, then the download makes sense. If no updates are present on the website I might be inclined to believe the server has been hacked and someone is trying to get me to download malicious things through the server. Which has been the case before.", "No i'm talking about when ur servers have slow server frame warning every 5 seconds. Its choking from calculating too much information on the server, because there are more players than the server can handle, its the server performance not the fps of the player. also if u can find a way to enforce everyone on the server to play with the same rates that would be great. or limit it to 256000 minimum. i'm tired of backtrack cheaters testing their cheats on DM with 98k rates.", "thank god we dont have a cheating problem any more. some attacks were driven after we started wth cs2. currently hackers mostly choosing other server. i wont tell you why. but feel free to proof me wrong with a video or something like that.\n\nif you see high server frames please report them... it's not usual at WaSe. There was an issue with LA right after the release and maybe with a few other servers not running on a dedicated machine. But this is already fixed.", "Again:\n\nWe don't accept Red Server frames! But problems of course possible. Please report with time, timezone and IP !!!"]}
