{"post_id": "1h6pnqm", "post_title": "I think the 14 / November / 2024 update broke the flashbang icon in the killfeed", "post_body": "Since that update I had a lot of kills with the flashbang icon appearing in the killfeed even if I got the kill before I was flashed or after the flashbang effects were fully gone. Have you had this issue?", "post_score": 77, "post_author": "busywinterfell", "post_created_utc": "2024-12-04 20:04:00", "comment_count": 3, "comments": ["I've definitely gotten some generous flash assists long after I had thrown the flash, although I don't think I've ever noticed when I'm doing the killing myself.\n\n...maybe my teammates aren't flashing for me enough...", "I noticed much more flashed kills happening too. Apparently I got 3 in a single match yesterday and I couldn’t even tell you when they happened. Idk if they made the icon stay longer or smth, but that's not at all what they did in this update, according to the notes at least.", "He noticed the exact same thing."]}
{"post_id": "1h6d8ii", "post_title": "Csgo 60 fps Cap (locked) after windows update", "post_body": "Hi everyone, as u can se in the title I did update windows last night (3 Dec) after that update, My Csgo fps locked in 60 fps and bcz of that I can't use 144hz , on setting's the display seted on 144Hz but bcz of the fps won't work, the vsync is off, I did noticed something that when I open gamebar (win+G) the frame goes to 155 that I set in Nvidia and Csgo setting's and when I close it it goes back to 60 \nI also used console to set fps max but didn't work\nHas anyone experience that??\nHas anyone have solution for this?\nAny hint or solution would be appreciated.\n(Sorry for my spelling mistakes)\n\n\n\nUpdate:The problem was AMD adrenaline \nIf u have amd , just go and reset all in amd setting, then put it in default (not gaming not performance not anything)\nHdr in windows setting is also effect (might for u)", "post_score": 0, "post_author": "Us_mohammad", "post_created_utc": "2024-12-04 10:45:21", "comment_count": 11, "comments": ["Check if you put your DP cable (or hdmi) in your mobo or in your GPU.", "Check windows energy settings\n\nGaming laptops always have some weird software for performance / eco mode to save battery.\nAnd some toggle down when you are not charging", "I have noticed that changing settings in the lobby only saves them. Try to set the fps in the lobby. Also you could put in launch options -freq 144", "Dumb question but did you enter in console: ”fps_max 0”? You mentioned you entered ”fps max”, that’s why I’m wondering.", "Ty\nSorry I forgot fo mention this, I have laptop I dont have second screen", "Ty\nI always use charger when gaming\nBcz without it it would be a huge difference in fps , like when plugged in it's around 144 fps\nBut without it it would be 20-30 fps", "I didn't completely understand, u mean type -freq 144 in console in lobby?", "In CS2’s launch options, put -freq 144 and -refresh 144.", "Where is lunch option??\nI dont get it", "Right click CS on steam, properties, launch options.\n\nAnyways, I assume your laptop has an actual graphics card and that you have Nvidia control panel\n You can set the monitor to 144hz right there.", "Ty\nI did type this exact word in lunch option\n-freq 144 and -refresh 144.\nDidn't work \nTyped also -freq 144 -refresh 144. Didn't work either\nCould u tell me the exact work , sorry i couldn't understand it that might be making mistake.\n\n\nYeah in nvidia control panel it's such thing for refresh rate for monitor\nThe problem for me is refresh rate is ok, but bcz of the limitations on fps to 60 the refresh rate isn't working bcz u know the fps is lower than refresh \n\n\nAnother thing is when I'm opening game bar (win key +G) it goes to 120 fps (the cs in background and I can see fps goes up)\nAnd immediately when I switch back it goes down to 60 again"]}
{"post_id": "1h69849", "post_title": "They fixed this annoying railing gap, you can now shoot through this", "post_body": "N/A", "post_score": 150, "post_author": "NFX_7331", "post_created_utc": "2024-12-04 05:55:34", "comment_count": 2, "comments": ["I was hoping for them to remove it. These spots are quite problematic since the opposition is much more likely to hit the bar.  \nSame goes for Nuke ct spawn stairs, which is outside next to hell. One side has no problem shooting through large gaps, the other side is likely shooting you through railing.", "This pipe should be gone, hate this bs spot"]}
{"post_id": "1h63inm", "post_title": "Shanghai CS2 Major Pick'Ems NEW Update! (Mac's picks)", "post_body": "N/A", "post_score": 4, "post_author": "Mac_AU", "post_created_utc": "2024-12-04 00:56:41", "comment_count": 0, "comments": []}
