{"post_id": "1hc4egx", "post_title": "Some cs2 bunny hops that I hit before August 19th update (No desubticked jumps anymore). And at the end some bhops from back then on csgo", "post_body": "N/A", "post_score": 5, "post_author": "KIMER0S", "post_created_utc": "2024-12-11 21:19:51", "comment_count": 22, "comments": ["Are you aware desubtick jumping is still easily possible?", "How did you hit like 12+ hops in a row in last clip? Wasn't it supposed to be near impossible to get 6-7++  let alone 12+? Or was there a nerf in CSGO at some point", "Holy........ imagine if that Desert Eagle landed at 0:47...........................", "I was never too into movement tech in CS:GO but enjoyed landing few bhops occasionally. I didn’t realize you could desubtick the jump until now, as I’ve just been playing CS2 casually with friends. However failing most of my bhops is starting to annoy me lol. Just watched a couple of YT videos on this, but most focus on advanced movement tech like longjumps and jumpbugs, which I’m not interested in. Could you share the simplest way to desubtick the jump to fix the bhop? I'd prefer not to copy a long config file containing more then what I need. Thanks!", "Shhh no it's completely patched!!!\n\n  \n(Valve please don't take it away from us again)", "Csgo never had a limit on how many bhops u can hit, but it had a speed limit if I'm not wrong", "It's basically just creating a new jumping-alias, which execs a separate config containing the jump action:\n\n`bind mwheeldown +jump_`  \n`alias +jump_ \"echo \"+jump\" | exec;\"`  \n`alias -jump_ \"echo \"-jump\" | exec;\"`  \n\n\n...with the separate configs `+jump.cfg` containing:  \n`jump 1 0 0`\n\n...and `-jump.cfg` containing:  \n`jump -999 0 0`", "valve should just make the goddamn jump NOT SUBTICK and everyone would be happy. \n\nIdk how anyone plays with the default jump bind, its so clunky", "what I remember was that there was an element of RNG with every hop and the more consecutive hops you had, the higher the chance of failure  so it had kind of a soft cap on bhops which was what made it very rare to hit 5-6 or more in a row since you needed good timing and also some luck \n\nthat was just my fuzzy understanding of it though could be wrong", "Thank you for the response! A couple of questions to confirm how this works:\n\n1. In the `game/csgo/cfg` directory, I'll need to create both the `+jump.cfg` and `-jump.cfg` files with the lines you provided, as well as an `autoexec.cfg` file (which I don't have) for the aliases and binds, right?\n2. From what I've seen on YouTube, updates sometimes break the configs. Is it common for the `+jump` and `-jump` aliases to break after updates, requiring some tweaks?\n3. I've already bound `+jump` to both `mwheelup` and `mwheeldown` through the in-game console. By binding `+jump_` to `mwheeldown`, I assume I can still use `mwheelup` for the regular `+jump` command in case the update breaks the config, correct?\n\nThanks again :d", "Yeah you're wrong. You're mistaking scrolling with rng - like literally everyone does for some reason. There have been so many threads detailing why bhopping isn't rng. It all stemmed from this one top comment on some top post ages ago saying that bhopping was rng, its an actual cancer idea plaguing the reddit community (no surprise there). A perf bhop (no other bhops count) is simply when you send a jump command on the same tick you land. Thats it. You can do this infinite times and consistently if you're good enough. Its actually WAY easier to do this (on flat surfaces) with spacebar as you dont have the drawback of the time inbetween each *click* of the scroll wheel, as with spacebar, you can just time the press each time.  \n\nThis has all gone to shit since sub tick. its still possible but a lot harder. The time frame in which you need to send that +jump command has narrowed considerably (x0.5), and thus, hitting perf bhops has become 2x as hard.", "1. Correct\n\n2. The commands inside the +/-jump.cfg will most likely stay the same. Instead of using echo pipe exec  \n`alias +jump_ \"echo \"+jump\" | exec;\"`  \nyou can also simply use this, which will also never change:  \n`alias +jump_ \"exec +jump\"`  \nThe first version also allowed to bypass the multi-input patch, but that got patched already as well.\n\n3. Yes, you can also overwrite these binds anytime. Keep in mind that the game remembers binds, but doesn't remember alias, so you need an autoexec for those, as you said in point 1.\n\nYou can check if it works by doing the mirage T-spawn arch test. Use these commands and check the position after using either jump-bind:  \n`sv_cheats 1; cl_showpos 1`  \n[This video](https://www.youtube.com/watch?v=YATqJzaL4ms&t=34s) is mostly outdated, but the timestamp shows the arch test.", "it is rng", "my understanding of the \"limits\" of hitting bhops in csgo were from the video and the discussions around it at the time\n\nhttps://www.youtube.com/watch?v=oTq4ZvNxowY\n\nthe video launders is talking about is by a youtuber named FrankieonPCin1080p who isn't a CS player but he started learning it and posted a video of him hitting like 7 hops casually while talking about how he learned how to bhop \n\ncan you explain why my understanding from that is different from how you're explaining it? still a bit confused", "nevermind I found this post which explains it pretty perfectly \n\nhttps://www.reddit.com/r/GlobalOffensive/comments/5v1h2d/bhopping_is_not_rng_explanation_also_you_dont/\n\nbasically it needs tick-perfect timing on the scrollwheel which is a 50/50 flip if you don't intentionally get the exact timing, but you can train to get the exact timing although you will never be able to obtain perfect consistency", "source: i made it up (like a spaz)\n\n[read](https://www.reddit.com/r/GlobalOffensive/comments/1hc4egx/some_cs2_bunny_hops_that_i_hit_before_august_19th/m1o23oa/)", "Literally the top comment from that thread is this:\n\n'Your argument is basically on the semantic meaning of RNG. Lots of players reference bhopping to RNG because it's impossible to consistently achieve relative to human capabilities. Your argument is like saying rolling a dice is not RNG because you can control the exact force and spin you put on the dice every time, which is unrealistic.'\n\nThat guy is literally lamenting in in the same fact I said before. For some reason, you actual luke warm IQ redditors don't have basic reading comprehension and are taking away a completely different conclusion to what the OP actually meant. Can you guys get it through your thick as two wood planks skulls that BHOPPING ITSELF ISNT INHERENTLY RNG BASED FUCK ME. Where the fuck are you getting this 50/50 flip from? The 50/50 flip from is coming from the human side of it, not the mechanical reality of bhopping.\n\nThe amount of times I've had to explain this is so dumb:\nIf bhopping was mechanically RNG, you wouldn't be able to make a macro to bhop for you perfectly. If sending a +jump command on the tick you land was RNG you wouldn't be able to program a macro to press 'space' (send a +jump) command on each landing tick perfectly every time. But you can. The amount of time that it takes to jump up and then land, will always be the same for flat surfaces (desubticked). Therefore if you know how long it takes to jump up and land, you can program a macro to repeatedly send a space (or whatever bind you use to jump) at the exact time you land everytime. This will result in a bhop script like experience (again, only on flat surfaces). The fact this works proves bhopping itself is not inherently RNG, you are just conflating the mechanics of a game to the inconsistency of the human as the original commenter suggested.", ">nevermind I found this post which explains it pretty perfectly", "> basically it needs tick-perfect timing on the scrollwheel which is a 50/50 flip if you don't intentionally get the exact timing, but you can train to get the exact timing although you will never be able to obtain perfect consistency\n\nyour summary of that post is so incredibly wrong - hence my comment", "No it's not it's just like what you said\n\nIt's a 5050 to land on the right input on the right tick. But it isn't random just because there's 2 possible outcomes. You can train to have consistency.\n\nYou were too busy ranting against your head canon demons to understand what I said"]}
{"post_id": "1hbwmel", "post_title": "please help i need to fix this asap, cant find help anywhere reddit please do your thing", "post_body": "just few days ago my cs2 feels like 60fps, it feels 60fps but it shows 190-220, i play on 180hz, i dont know how do i explain i will put video, when i jump throw my guns it like stutters or like it feels like 60-40fps when i move with my mouse, strafe ect.. but mostly when i use my keyboard+mouse to move it like lags but not lags it kind alike moves left to right really fast its really annoying and i cant find the fix ANYWHERE like ANYWHERE, if someone know how to fix this it would help alot.You can see in a video if fucking feels like 60fps im playing like i said 200-180fps on 180hz monitor and i checked always everything i set to 180hz. It really feels so choppy like you can see in a video. Please reddit do your thing.", "post_score": 0, "post_author": "Sakaplinkoviq", "post_created_utc": "2024-12-11 15:56:27", "comment_count": 18, "comments": ["This is not just tearing (look at the corner of the wall). I had this happen in the past when my mouse pollingrate was on 125hz which I didn't know.\n\nLong version here: https://www.reddit.com/r/LogitechG/s/7JtRt5CCA1", "Turn off vsync and turn on freesync/gsync", "Turn off vsync in video settings and if it's not helping you have not enough fps or hertz", "Recently I’ve been having issues with games and the full screen optimisation not working correctly. Google how to disable/enable it and try playing and see if it fixes the issue.", "That just looks like tearing: https://en.wikipedia.org/wiki/Screen_tearing", "Show me a photo of your video/display settings. not advanced.\n\nSomething tells me you are not running the game at fullscreen or at the correct refresh rate.", "[removed]", "I know games which don’t match the output frame rate to monitor refresh rate and cause abhorrent tearing.\n\nYou might be rendering at 200fps, but the game is only sending 60fps to your 180hz monitor. \n\nCheck your resolution selector in game or anywhere else to see if it’s set to (Your Resolution) + [monitor hz].\n\nTry switching between full screen, borderless windowed or windowed. And try Alt + Enter or F11 to full screen from windowed.\n\nUnplugging monitors could also randomly fix this. So can random things you do with the graphics drivers/updates or just restarting the pc I general.\n\nMaybe even a launch flag to set the output frame rate.", "vsync", "Turn off VSync 🫡", "im not using logitech", "But OP clearly doesn't have vsync on with the massive tearing that's going on there?", "ok bro i try later i will respond outcome", "i send you later bro", "holy shit", "Brand does not matter, check the polling rate. I've had similiar issues back in csgo and it was because of mouse polling rate.", "I'll wait![gif](emote|free_emotes_pack|wink)", "Problem solved, thank you so much man"]}
{"post_id": "1hbq8sq", "post_title": "Can you play the Pick'Em for free, buy the coin later and still upgrade your coin?\n", "post_body": "As the title says, can you do that or is it only gonna give me the basic one after buying the coin?", "post_score": 0, "post_author": "Famous-Spite1202", "post_created_utc": "2024-12-11 10:03:55", "comment_count": 7, "comments": ["Everyone would do that and only pay if they get the matches right", "no", "Nah, you had to buy the pass first and then you can get coin by pick'em", "No, only pickems done after buying/activating the pass will give you points towards upgrading the coin.", "Valve updated the text in a recent update that should make this clear: No coin at the time of making the picks = No credit.", "Stupid people thing.", "No, it wouldn't be a gambling then, and valve counter strike profits are gambling-driven"]}
{"post_id": "1hbp3up", "post_title": "What CS2 Needs to do to surpass CSGO (Post Train Update)", "post_body": "Hi guys, I wanted to do a follow up to my previous [post](https://www.reddit.com/r/GlobalOffensive/comments/1fh6ccn/what_cs2_needs_to_do_to_surpass_csgo/) where i pointed out the main issues in CS2 regarding the gameplay experience and some personal takes with CS2 that were gatekeeping it from becoming better than CSGO. It's been 3 months but there has been substancial upgrades made to the game that i think are worth covering it.\n\n# Main issues addressed:\n\n\\- **Jump height being unreliable has been addressed.** (It may happen from time to time to get stuck but it isn't often)\n\n\\- **Character Animations tweaked to match CSGO behaviour**\n\n\\- **Delayed kill animations can be nullified with new damage prediction settings** (It can fail from time to time if your ping is high or if you got shot and killed before you shot him, but its better than nothing.)\n\nThese 3 Issues i've listed may not be much for some but it improves the gameplay experience by a lot, thanks to these issues being ironed out it removes a lot of the unpredictability and major annoyances the game had.\n\nThe new character animations help a lot with the feedback and readability you get when being peeked on to more accurately represent where the other player actually is and see more clearly changes in direction instead of the old version where the legs had to catch up to the torso and head making it very confusing to predict enemy movement.\n\nThen with the changes made to jump height it helped remove the most annoying bug in the game that was getting stuck while trying to jump to an elevated area and the game would just push you down and wouldn't let you get there.\n\nAnd at last my personal favorite is the damage prediction settings. I know it's a bandaid fix until they can further iron out the problem but this was one of the things that for me made the game for me much more inferior than go the fact i could tell that there was a delay in kills made the game so unsatisfying to play some times but with this setting that csgo feeling when getting a crisp headshot came back to me and made the game so much more enjoyable for me, sure it can fail from time to time but i couldn't care less when 80-90 percent of the time works for me and most of the false positives i can easily identify because when it happens is when i get killed so it doesn't detract from the experience for me.\n\n# Important issues that still are needed to address:\n\n\\- **Premier needs to reinvent itself/give more personality to ranks or make substancial changes in premier elo distribution**\n\n\\- **Jumping needs to be desubticked to match CSGO bhop perfomance**\n\n\\- **Adjustements made to blood to achieve clearer visual hit confirmations on the chest** This has been bothering me since launch i cannot precisely tell how many shots landed on the enemy's body and i have to come up with a random damage number i think ive given to the enemy. In CSGO the visual hit confirmation of the enemy's blood splatter was so good i could instantly tell how many shots landed on my opponents and give accurate info on how many shots landed on my opponents. Valve pls adjust. (i believe this to be the thing that makes CS2 spraying so much worse because i cant tell how many bullets landed on the target)\n\n\\- **Tweaks to economy to better match MR12**\n\n\\- **Replace Competitive playlist to a Normal 5v5 playlist with premier match settings.** (What i mean by match settings i refer to being able to go to overtime and having 3 timeouts instead of 1)\n\n\\- **Buff Famas**: Faster reload time, Bullet mag size 30-35, a little more acurracy, Reduced price to 1950 or 2000 and the gun is fixed.\n\n\\- **Nerf Galil**: Mag size to 25 and maybe make it 1900$\n\n\\- **Improved community server browser and more exposure in menu for servers**\n\n**- Swap CT and T molotovs fire durations:** This will make a fairer tradeoff in between the two of them and make the player decide if they want a longer fire duration at the expense of less ground covered or If they want to cover more ground at the expense of a shorter fire duration\n\n# Minor issues but very welcomed if fixed or changed:\n\n\\- **Re add Third person finishing defuse animation**. In CSGO when the CT was ending the defuse you could slowly see that in the last remaining second an animation would play that the CT would slowly go to grab the gun with both hands indicating that he is very close to defusing the bomb, this was an important visual cue for me but in CS2 this animation is nowhere to be seen\n\n\\- **Recoil cooldown tied to tick rate instead of interpolated** [**https://www.reddit.com/r/GlobalOffensive/comments/1ewlyu0/one\\_year\\_reminder\\_recoil\\_cooldown\\_is\\_still\\_tied/**](https://www.reddit.com/r/GlobalOffensive/comments/1ewlyu0/one_year_reminder_recoil_cooldown_is_still_tied/)\n\n\\- **Movement affecting crosshair on sloped surfaces** [https://www.reddit.com/r/GlobalOffensive/comments/1f4snmr/almost\\_a\\_year\\_after\\_cs2\\_release\\_valve\\_still\\_didnt/](https://www.reddit.com/r/GlobalOffensive/comments/1f4snmr/almost_a_year_after_cs2_release_valve_still_didnt/)\n\n**- Valve Deathmatch Servers**: Reduce Spawn protection from 10 seconds to 5 seconds. Bullets refunded after a kill.\n\n# Additions:\n\n\\- **Reintroduce remaining maps**. Cobblestone, Tuscan, Lake and shortdust (Cache is a fmpone map so i dont include it on the list)\n\n\\- **Introduce a new defuse animation similar to valorant's defuse one** (Personal but i believe it would make the game more immersive)\n\n\\- **Re add character factions to maps**: it expresses more personality and uniqueness to the maps.\n\n\\- **Add viewmodel menu on game settings**: This is the last important aspect of the game that is behind console commands only.\n\n\\- **Introduce a tournament mode for premier**: Make tournaments with small prize pools nothing excessive like fortnite does for its cash cups (Maybe 5000 usd prize pool?) once a month or 2 and i think this will make premier more valuable and competitive as a result of this feature but also make it so in order to participate you must have at least 2 medal services from 2 separate years done to be able to play them so as to reduce cheaters from infesting them.\n\n# Conclusion:\n\nI believe as of right now the game is in a really bright spot and just needs small but easy tweaks to be on par with CSGO. If the devs continue to address big community concerns as they have done in these past few months CS2 will most likely reach CSGO status very soon but time will tell. In my eyes if they manage to address The blood visual hit confirmation, the economy and desubticked jump the game will have finally surpassed CSGO", "post_score": 0, "post_author": "Capital_Bee_1250", "post_created_utc": "2024-12-11 08:34:38", "comment_count": 19, "comments": ["Bring back 128 tick and let it run with subtick. This will make the game better than CSGO ever was.", "nerf mp9??", "Some of these suggestions are pretty good and I can understand why you made them.\n\nJust to clarify, what do you think Valve should do to fix the economy? I know it’s fine for Ts, but CT needs help and I’m curious as to what you think.", "by bringing back Cache", "> Improved community server browser and more exposure in menu for servers\n\nThis will never happen. The community did this to themselves.", "Not sure if thats even possible, also how would that change anything?", "As of right now i think its a necessity for it to be op due to the famas and economy being so dog water, but if ironed out how would you suggest nerfing it? Lowering rpm?", "they already nerfed T economy with bomb plants, and they reduced the cost of CT mollies.  Do you think they need to make more adjustments?", "What i believe they should do as an easy fix is to remove the first loss bonus (1400$) these will most likely solve the issue with doble eco on ct side. And will negate more the impact on pistol rounds.", ">also how would that change anything?\n\nConsistency. Just like with FPS: you want high but consistent FPS, because otherwise, performance would not be optimal. In Subtick, having to check if a character did something in a specific millisecond is inefficient for the server and the user.", "With damage prediction working fine 99% of the time on my end, absolutly nothing.", "I believe so. There are a lot of instances of having to go into a double eco as a CT, which quite frankly sucks and prevents from more aggressive plays from happening while on CT on gun rounds. I think adjusting the economy to fix this would be great, whether that’s a change to loss bonus, or something else.\n\nI think as a counterbalance (assuming the aforementioned famas change happens), the mp9 should be nerfed. I’m not sure if it’s with damage, magazine, or both.\n\nI’m not sure if this would make CTs overpowered but I think 2900 for both M4s could be interesting and could also help with the economy a little bit.", "Thats a hard buff for T too with the cheap galil", "So nothing would change. Except the server quality, since 128 tick costs 3 times more resources, which is already bad", "It would change some things. Faster gameplay (less peeker adv) and/or smoother gameplay. \n\nIn CSGO it was fairly common to play 1 tick of interp online. There will be micro fluctuations for many players. Having 1 tick to smooth things out helps. Adding one tick in CS2 however adds too much delay. Its bad already at 35ms (compared to bad at 50ms on CSGO), no Bueno. \n\nAlternatively ofc they can build servers everywhere and hope for enough players in the area, so that everyone can play at 5ms. Sounds more expensive than 128 tick though.", "Please explain how 128 tick would make gameplay  faster and reduce peekers advantage, which is caused by networking", "Everything is processed 8ms faster(or 16 with 1 interp), so not a lot but it all adds up.", "It's doesn't add up, and on top of that, it reduces client's performance and increases resources required by the server", "You dont think the different things that contribute to delay (network, server/client calculations, rendering..) adds up? Or you just decide tickrate dont contribute to delay? \n\nThoughtexperiment; why do you think we need 64 tick, and cant play at 1 tick for example? What would happen?"]}
