{"post_id": "1hbfzwa", "post_title": "f0rest deagle 1v4", "post_body": "N/A", "post_score": 242, "post_author": "vit4lc", "post_created_utc": "2024-12-10 23:50:09", "comment_count": 25}
{"post_id": "1hbfe2i", "post_title": "What information did you learn late into playing cs that helped you?", "post_body": "Im curious what mechanical or mental information you learned pretty late into playing cs that made you a lot better after learning it? Something you learned maybe 2k hours into playing? It can be something mechanical like how to aim correctly or WHEN to peek/when to use certain peeks. Maybe you watched a pro vod and noticed some mechanical thing a player did that you never thought about or something about positioning or utility? Just trying to spark some ideas into my head for things to change. im in a rough patch playing cs where I haven't top-fragged in a faceit 10 lobby in a very long time and I feel like im on an extreme plateau. i just want to see if there is useful information that could help me out. (it could also be something you actually did wrong for a very long time but you never noticed it and decided to change it.)", "post_score": 10, "post_author": "IcedCS", "post_created_utc": "2024-12-10 23:21:46", "comment_count": 24}
{"post_id": "1hbdqw5", "post_title": "Case opening Netherlands and Sweden", "post_body": "Alright so i live in The Netherlands where opening cases is not allowed. If i go to Sweden for vacation will i be able to open cases once im there? \n\ni think i also need to change the store region and will i be banned for doing that and then opening cases?\n\n\n\nThanks to anyone who decides to help me!", "post_score": 0, "post_author": "No-Echo-3881", "post_created_utc": "2024-12-10 22:08:06", "comment_count": 4}
{"post_id": "1hbceam", "post_title": "What's your \"secret\" pro tips in CS?", "post_body": "My golden rule is to avoid throwing nades in situations where the enemy doesn't know where I am (for example in a 1v2 post-plant - or when I'm sneaking out B apps on Mirage) to surprise the enemy. Anything you have? ", "post_score": 94, "post_author": "iMSoFuxkinqqqHigh", "post_created_utc": "2024-12-10 21:10:06", "comment_count": 145}
{"post_id": "1hbar1b", "post_title": "Perfect world", "post_body": "can someone explain to me why everything related to chineese cs is labeled with \"perfect world\", tournaments, music kits (both of which are super lit btw)", "post_score": 0, "post_author": "LewisRosenberg", "post_created_utc": "2024-12-10 20:01:11", "comment_count": 8}
{"post_id": "1hbae8s", "post_title": "Xizt breaks down the type of player NIP are after", "post_body": "N/A", "post_score": 182, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-10 19:46:07", "comment_count": 36}
{"post_id": "1hba12h", "post_title": "Switching between a light spectate and someone in a smoke can let you see enemies in the smoke", "post_body": "I experienced this while playing and was very glad it shows through on the gotv recording.\n\nWhen dead, if you click and switch back and forth between someone standing in a smoke and someone with a light background, the silhouette of someone hiding in the smoke sometimes shows.\n\nhttps://imgur.com/o04gNR5", "post_score": 71, "post_author": "Sydadeath", "post_created_utc": "2024-12-10 19:30:32", "comment_count": 8}
{"post_id": "1hb9vzg", "post_title": "CS2 feels weird, and I dont know why...", "post_body": "Something is... off.\n\nMy aim is weird, it feels like my crosshair is lagging across the screen rather than one fluid motion. The game feels like its running 60hz even though its 144hz. The FPS lows are huge and the entire game feels like a clunky mess which wasnt the case just a week ago.\n\nAll Ive done recently was turn on memory integrity to get the Faceit AC working but surely that cant cause all these issues? Maybe my mouse is broken? Maybe some PC component is starting to break? Anyone else had similar issues?", "post_score": 16, "post_author": "Trawzor", "post_created_utc": "2024-12-10 19:24:35", "comment_count": 30}
{"post_id": "1hb9vnz", "post_title": "EZ Negev Ace on Train", "post_body": "N/A", "post_score": 27, "post_author": "tracemyers22", "post_created_utc": "2024-12-10 19:24:12", "comment_count": 3}
{"post_id": "1hb8rs2", "post_title": "Average round on a Helsinki server", "post_body": "N/A", "post_score": 834, "post_author": "A1tze", "post_created_utc": "2024-12-10 18:38:23", "comment_count": 36}
{"post_id": "1hb7al3", "post_title": "Parkour and body faint knife ", "post_body": "N/A", "post_score": 0, "post_author": "samuellhc", "post_created_utc": "2024-12-10 17:36:49", "comment_count": 6}
{"post_id": "1hb6k9k", "post_title": "This good enough to post here?", "post_body": "N/A", "post_score": 12, "post_author": "Alternative_Rub9911", "post_created_utc": "2024-12-10 17:05:57", "comment_count": 12}
{"post_id": "1hb5h42", "post_title": "Does CSGO have one of the best communities?", "post_body": "Okay, I just stumbled upon this precious [post](https://www.reddit.com/r/GlobalOffensive/comments/1z6ujl/does_csgo_have_one_of_the_best_communities/from) 11 years ago about how wholesome the CSGO community was, and I literally can't- 💀\n\nThe OP was like \"everyone's so nice and encouraging!\" and I'm sitting here in CS2 being called a \"kitchen camper\" just for clutching a 1v3. Like, honey, the only thing that hasn't changed in 11 years is my aim being better than your attitude!\n\nDon't get me wrong, I've met some amazing people in CS2 (shoutout to my homies who doesn't immediately mute me when they hear my voice), but watching this community evolve has been wilder than my spray patterns!\n\nWhat do happened? Did we lose our wholesome gamers to Valorant, or did everyone just become extra spicy after getting one too many Zeus kills...\n\nxoxo", "post_score": 0, "post_author": "QweenOfGaming", "post_created_utc": "2024-12-10 16:19:46", "comment_count": 17}
{"post_id": "1hb3vwx", "post_title": "NIP bench maxster", "post_body": "N/A", "post_score": 188, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-10 15:10:08", "comment_count": 45}
{"post_id": "1hb2unz", "post_title": "Easiest Quarterfinal Predictions Ever", "post_body": "**Disclaimer:** I enjoy the different dynamics and aspects of all teams in the playoffs and what they've brought to the table this year. I'm completely neutral except for one team, which is Spirit, which I'm definitely more of a fan of than the others.\n\n&nbsp;\n\nWith that said, the quarters this time are surprisingly easy to predict despite some of the discourse around it seemingly being not the case. Here's what's gonna happen:\n\n&nbsp;\n\n---\n\n### **MOUZ vs MongolZ:**\n\nWinner: **Mouz**\n\n&nbsp;\n\n* MongolZ is not a Top 5 Team. Never been in a single T1 Playoffs the whole year.\n\n&nbsp;\n\n* MOUZ should have won 8/10 times the b01 that they lost.\n\n&nbsp;\n\n* MongolZ being favorites due to being in China is a slightly fake narrative. Hell, MOUZ choking/underperforming while under pressure is a bigger thing to look towards if MongolZ is to win. \n\n&nbsp;\n\n* The B03 that they won to advance to the Playoffs was against HEROIC, a team they had just beat in Thunderpick. HEROIC's in a good form, but they're still on the bottom half of teams going into playoffs, at least on paper. Regarding their recent match up, there could be an element of MongolZ just matching up well against HEROIC, and even if that's the case... at end of the day, they're just two B03's against an outside Top 5 team, at times outside top 10 team, so it's hard to judge how they will fare against a real, consistent top 5 team, which MOUZ certainly has been this year. \n\n&nbsp;\n\n* I picture it like this: What's more likely? MongolZ keeps their hot streak form to beat a Top 5 team in MouZ in a b03 (Which is still a hard thing to do even with their form), where they should have lost the b01 before even in their hot form... or MongolZ just simply revert to the form they've had all year long - one of being a Great team, but not an Elite team. All rationale points towards the latter.\n\n&nbsp;\n\n* Slightly rooting for MongolZ to win.\n\n&nbsp;\n\n---  \n\n### **Spirit vs Liquid:**\n\nWinner: **Spirit**\n\n&nbsp;\n\n* Liquid had easy opponents in their 3-1 run, playing GamerLegion and the NA RMR. They still dropped a map to MIBR. \n\n&nbsp;\n\n* Liquid barely won a limping, 'all except donk' underfperforming Spirit at Fall Final. Who on Liquid is currently realistically standing up to Spirit's stars? \n\n&nbsp;\n\n* Liquid has had a solid YEKINDAR this tournament. Even if he keeps the uptick in his performance, I *still* can't see them winning current Spirit. Even if just one of the supporting Spirit cast decides not to disappear, there's no reality where Liquid wins.\n\n&nbsp;\n\n* [EU (Yes, CIS) vs \"NA\"... Come on](https://www.youtube.com/watch?v=O53hM8smids)\n\n&nbsp;\n\n* Rooting for Spirit\n\n&nbsp;\n\n---\n\n### **FaZe vs Vitality:**\n\nWinner: **Vitality**\n\n&nbsp;\n\n* What's there to even say? Can FaZe ~~Bulls~~ Magic beat in form Vitality, where even support players like Mezii are popping off? \n\n&nbsp;\n\n* Vitality had an easy run, yet even an overrated Vitality dropping back to reality or even underperforming a lot still seems like an impossible force to overcome for the current FaZe.\n\n&nbsp;\n\n* Rooting for FaZe\n\n&nbsp;\n\n---\n\n### **G2 vs HEROIC**\n\nWinner: **G2**\n\n&nbsp;\n\n* Too much firepower on G2. \n\n&nbsp;\n\n* Too much at stake for NiKo and m0NESY to lose. Not in quarters at least, and certainly not to HEROIC.\n\n&nbsp;\n\n* Personally, I believe this to be the hardest match to predict, not in terms of how close the two teams should be, but how it will go down in reality. I do believe G2 *should* take this down comfortably if they are to win the Major, but if there's one match that doesn't go the way I've outlined - it's this one.\n\n&nbsp;\n\n* Ever so slightly rooting for G2\n\n&nbsp;\n\n\n---\n\n&nbsp;\n\nLink this truth after Friday - It's just how it's gonna be!", "post_score": 3, "post_author": "TryQuality", "post_created_utc": "2024-12-10 14:22:39", "comment_count": 9}
{"post_id": "1hb29ua", "post_title": "Well that's one way to enter A-site...", "post_body": "N/A", "post_score": 260, "post_author": "cymonxd", "post_created_utc": "2024-12-10 13:55:21", "comment_count": 16}
{"post_id": "1haz6ml", "post_title": "Meeting in Shanghai", "post_body": "Hey, I’m 25M alone In Shanghai for playoffs and i couldn’t find any posts and have no idea where english speaking people exist here, so if someone is interested in meeting hmu. 🤙 ", "post_score": 93, "post_author": "ZELElegend", "post_created_utc": "2024-12-10 10:53:46", "comment_count": 11}
{"post_id": "1haycsa", "post_title": "How is this stream quality acceptable?", "post_body": "N/A", "post_score": 0, "post_author": "eXcelleNt-", "post_created_utc": "2024-12-10 09:53:04", "comment_count": 6}
{"post_id": "1hay0wf", "post_title": "w0nderful future ?", "post_body": "He’s the one player people believe will get benched if Navi decide to change anything at all.\n\nDespite som disappointing finals from him he only have 1 negative rated event being the Blast world final\n\nThoughts? ", "post_score": 0, "post_author": "Lord_bone_universal", "post_created_utc": "2024-12-10 09:27:12", "comment_count": 35}
{"post_id": "1haxa5h", "post_title": "Distorted/Broken audio in Cs2, Using Scarlet 4i4 and a ROG STRIX G513", "post_body": "Pretty much went to install CS2, first night went well but the next day I booted it up to play with my friends and I can only describe it as getting ear raped by every noise in the client. Every single noise had static/distortion was sometimes laggy and was super boosted in volume. **To be clear I only have this issue with CS2.** I've seen a couple other threads on this issue that seemed similar, notably this [one](https://www.reddit.com/r/GlobalOffensive/comments/168e2ty/distortedbroken_sound_in_cs2/), but my problem still remains. My audio setup is a Scarlet 4i4 plugged into a ROG Strix G513, with my audio input and output routed through the 4i4 by usb.\n\n  \nThings I've Tried.\n\n* Updating Realtek Audio Drivers through windows\n* updating Focusrite Control 2\n* Restarting (I shutdown nightly)\n* Deleting CFG folder in the steam directory and Restarting game\n\n  \nThe only things I have yet to try are updating to windows 11 (its installing) and routing my headphones through my laptop which I would prefer to avoid if I can. Anyone have any other ideas?\n\n\n\n", "post_score": 2, "post_author": "Top_Age524", "post_created_utc": "2024-12-10 08:28:33", "comment_count": 4}
{"post_id": "1hauiqp", "post_title": "What are some of the best 2013-2017 virtus pro games to watch?", "post_body": "just had to think about VP again when reading through another thread here, what are some of the best games to watch from that era of VP?", "post_score": 6, "post_author": "Poe_Cat", "post_created_utc": "2024-12-10 05:19:14", "comment_count": 9}
{"post_id": "1hata5k", "post_title": "Inspect bug?", "post_body": "Anybody else having issues with inspect?\n\nMine is bound to X....when I hit inspect at the start of the game it will do it...but it glitches and its as if I am holding down X. If I switch weapons its still spamming inspect.\n\nOnce I left click, the inspecting stops then I can't inspect for the rest of the game...\n\nAnybody else?\n\n  \nEDIT\n\nI fixed it.\n\nFor some reason my autoexec isnt working at all, even though it is in counterstike global offensve > game > csgo > cfg.\n\nI checked the console on launch and the echo wasnt showing...I copy and pasted these commands into the console:\n\n>\n\n>\n\n>\n\nAnd it worked perfectly and my inspect is now fixed... Thanks for your help man you helped me get to the root of the issue. Not sure why my autoexec isnt working but whatever dont care.\n\n  \n", "post_score": 2, "post_author": "BullyMog", "post_created_utc": "2024-12-10 04:09:52", "comment_count": 12}
{"post_id": "1haspw7", "post_title": "Please help", "post_body": "I was playing Counter-Strike and I loaded up a casual map. No one was there apart from bots, so everything was normal until after round 2. A lot of people joined, and at first, I thought it was normal, but then I checked their names out of habit, and all of them were Chinese. Literally, every single person on the Terrorist and Counter-Terrorist teams had the exact same name. I was confused. So the round just finished, and when I spawned back to T spawn, all of them were AFK— all 9 players. I waited for a few seconds, and they all shot at the same time. I was freaked out, so I went to check on the Counter-Terrorists, and they were doing the exact same thing— AFK and shooting randomly every few seconds. Then a real person joined and immediately voted to kick me, and it literally took 2 seconds for all the Terrorists to vote F1. Can someone please explain? Because I'm genuinely fucking  horrified", "post_score": 0, "post_author": "ElectronicMuffin8325", "post_created_utc": "2024-12-10 03:39:10", "comment_count": 5}
{"post_id": "1hapq4k", "post_title": "Glock 1v5 Ace", "post_body": "N/A", "post_score": 34, "post_author": "matheustives42", "post_created_utc": "2024-12-10 01:04:53", "comment_count": 7}
{"post_id": "1hapjvo", "post_title": "I feel like the dink animation made him flinch a little TOO hard", "post_body": "N/A", "post_score": 147, "post_author": "Papashteve", "post_created_utc": "2024-12-10 00:56:31", "comment_count": 44}
{"post_id": "1hapj6q", "post_title": "\"This is greedy, right?\"  \"[laughing] soooo greedy\"", "post_body": "N/A", "post_score": 2, "post_author": "Cosmic_F_", "post_created_utc": "2024-12-10 00:55:33", "comment_count": 2}
