{"post_id": "1h6ur02", "post_title": "Weird collision on Train", "post_body": "https://reddit.com/link/1h6ur02/video/tm2the7y2x4e1/player\n\nI don't think this is intentional and even if it is; this should no be happening. It doesn't make sense texture wise as well as logically. ", "post_score": 0, "post_author": "TonkaLive", "post_created_utc": "2024-12-04 23:35:15", "comment_count": 3}
{"post_id": "1h6r10v", "post_title": "what electronic said about VP some time ago according to Mauisnake", "post_body": "N/A", "post_score": 344, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-04 20:59:51", "comment_count": 51}
{"post_id": "1h6qj8a", "post_title": "donk‘s pick‘ems for the  Shanghai elimination stage", "post_body": "N/A", "post_score": 786, "post_author": "falsa_ovis", "post_created_utc": "2024-12-04 20:39:40", "comment_count": 109}
{"post_id": "1h6q2dd", "post_title": "What game mechanics you would like in a CS manager game ?", "post_body": "Dear lads,\n\nAs a reaction to this post : https://www.reddit.com/r/GlobalOffensive/s/eSowMsfRWa\n\nWhat mechanics would you like to see in case a FM-like game in the CS world is getting released ?\n\nI thought a lot about and would like to know your Pov. \n\nSee ya", "post_score": 3, "post_author": "East-Rich5540", "post_created_utc": "2024-12-04 20:20:16", "comment_count": 6}
{"post_id": "1h6phu0", "post_title": "Annotations with friends", "post_body": "When setting up a practice server to play with friends, you cant load annotations. Any reason for that?", "post_score": 0, "post_author": "mikseri-", "post_created_utc": "2024-12-04 19:57:37", "comment_count": 0}
{"post_id": "1h6nldl", "post_title": "Virtus.pro CEO: \"If replacements are required, they will be made\"", "post_body": "N/A", "post_score": 106, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-04 18:41:33", "comment_count": 40}
{"post_id": "1h6n0vr", "post_title": "Make Pick'Ems accessible for people with jobs or other challenges ", "post_body": "TL;DR: can we enable players to make their Pick'Ems picks without access to the game? \nEvery major cycle we have posts asking for it. Some suggestions below.\n\n\nContext:\nNot everyone has access to the game all the time. Though being an adult with responsibilities sucks, we can't avoid it.\n\nI can't speak for others but I am sharing my experience. If it is a \"me\" problem, I will suck it up and live with it. \nI am a long time player and huge fan of the e-Sport scene. I love Pick'Ems and want to support the teams. This week I have to travel for work and now I am in a situation where I cannot make my picks for the next stage. When I get back, I most likely won't do the next stage, my motivation is not there. If this is how it is going to be, I am not willing to buy a pass next time. \nWhy: because I can't participate, why should I pay? If I sucked and made wrong picks, I don't mind. \n\nSuggestions:\n1. Webapp is the obvious one. I think there was a community based one that I am not sure worked, for sure it doesn't work now.\n\n I can understand that you don't want people logging on to a website that can be spoofed and open up a new attack vector. Thus the following suggestions:\n\n2. In-Game but let people pick the entire tournament in one go. This way we have a choice and we can lock our picks in one go. If we are horribly wrong, that's on us. At least we have a chance to play.\n\n3. In the official steam app. The app is there, can be verified and most likely people already have it.\n\n\nApologies for formatting. Mobile, reddit, on the move :(\n\nI hope my post made sense and community can chip in.", "post_score": 0, "post_author": "Laxatives_R_Us_CEO", "post_created_utc": "2024-12-04 18:18:50", "comment_count": 9}
{"post_id": "1h6mhol", "post_title": "SAW transfer list ewjerkz", "post_body": "N/A", "post_score": 4, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-04 17:57:46", "comment_count": 1}
{"post_id": "1h6lm6w", "post_title": "A eulogy (praise) for NiKo", "post_body": "N/A", "post_score": 0, "post_author": "alexanderseraph", "post_created_utc": "2024-12-04 17:23:54", "comment_count": 5}
{"post_id": "1h6m0x5", "post_title": "SAW transfer-list ewjerkz", "post_body": "N/A", "post_score": 129, "post_author": "ChaoticFlameZz", "post_created_utc": "2024-12-04 17:39:57", "comment_count": 42}
{"post_id": "1h6kovd", "post_title": "CS documentary \"Memories of CS:GO - The Final Years\" is out! ", "post_body": "N/A", "post_score": 230, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-04 16:47:28", "comment_count": 14}
{"post_id": "1h6k1kh", "post_title": "Thoughts about Pick'em", "post_body": "Do you think the Pick'em in its current form makes sense or is this just copy and paste so the business can go on? It hasn't been changed in several majors now, and each time I'm more convinced that the scheme is ill-conceived. What conclusions can we draw from the example of the upcoming G2 vs Mongolz match? On paper G2 looks definitely better, but we should consider that Mongolz is already warmed up and it's BO1 where map selection is highly unpredictable. Is Pick'em supposed to be used for blind betting? What should my 3-0 team selection depend on? How can you predict anything without knowing the map in BO1? Convince me that I am wrong and no, I have no idea for a better solution, I am not a multi-billion dollar corporation.", "post_score": 0, "post_author": "a_c_r_e_a_l", "post_created_utc": "2024-12-04 16:21:38", "comment_count": 9}
{"post_id": "1h6ju5d", "post_title": "fast 1v4 clutch ", "post_body": "N/A", "post_score": 27, "post_author": "Laretus", "post_created_utc": "2024-12-04 16:13:30", "comment_count": 1}
{"post_id": "1h6j12x", "post_title": "How much each player carried at the Elimination Stage.", "post_body": "N/A", "post_score": 154, "post_author": "jonajon91", "post_created_utc": "2024-12-04 15:40:55", "comment_count": 30}
{"post_id": "1h6ik46", "post_title": "EliGE: \"I'm going to do whatever it takes to make sure I'm in a position to win in 2025\"", "post_body": "N/A", "post_score": 788, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-04 15:21:39", "comment_count": 158}
{"post_id": "1h6gd9u", "post_title": "Weapon Switch while reloading in CS2", "post_body": "I haven't seen any discussion about this, and I hadn't played GO since 2020 when I starting playing CS2, but I've noticed that it seems like when instantly switching to knife and then pulling out a gun after a reload, sometimes in CS2 it doesn't register and the reload doesn't go through. Even when the ammo count goes from 0 to full for a frame or two, if I switch too quickly it resets to 0. I don't remember this ever happening in GO, and it seems like an easily fixable and significant issue.\n\nMaybe this did happen in GO, and while I know it doesn't make reloads any quicker, I really value the clear visual cue of the pull out animation finishing to indicate when I can start shooting again. Has anyone else had a problem with this?", "post_score": 3, "post_author": "derpdude9", "post_created_utc": "2024-12-04 13:46:46", "comment_count": 11}
{"post_id": "1h6g5js", "post_title": "Saw an accidental wallbang spot on Reddit a while ago and decided to make it more useful", "post_body": "N/A", "post_score": 76, "post_author": "TNCruncher", "post_created_utc": "2024-12-04 13:36:28", "comment_count": 8}
{"post_id": "1h6ente", "post_title": "Why do people get so heated when it comes to claiming a certain region of the world is better at a video game?", "post_body": "I don’t think people understand this concept, I live in the country of Canada where the sport of hockey is basically a religion here, and you know who wins the Gold Medal or finishes top 3 at the Winter Olympics every year? That’s right you guessed it Canada! Shocker.\n\nWe also beat other countries that don’t have a huge population of people who play hockey so badly sometimes the game has to be ended short due to a mercy rule.\n\nHow hard is it to grasp this concept to the people in Europe? Yeah no shit you’re the best region, you have the biggest selection of players, the best tournaments, the best teams to consistently play against, it’s no wonder that Europe has produced some of the best teams/players.\n\nIt’s no different with League of Legends, every single year practically at Worlds, the biggest League of Legends tournament, the European teams they send to compete can almost never beat the Korean/Chinese teams, does this mean that the Europeans are less smart? Lower iq? Unable to ever play the game at the level of the Koreans/Chinese? \n\nI’m just so sick of these neckbeards pounding their chest with pride because some overweight person from the country they reside in was able to tap on some heads with his mouse. If that’s what you get pride in you need to re-evaluate your life!\n\n ", "post_score": 0, "post_author": "Dangerous_Track_6397", "post_created_utc": "2024-12-04 12:18:41", "comment_count": 19}
{"post_id": "1h6dkg6", "post_title": "Tried my hand at an Arcane style edit (After Effects is hard)", "post_body": "N/A", "post_score": 0, "post_author": "CakeAT12", "post_created_utc": "2024-12-04 11:07:52", "comment_count": 17}
{"post_id": "1h6ddf6", "post_title": "One tapping everyone at banana | Daily dose of XM carnage ", "post_body": "[Youtube link](https://youtube.com/shorts/pXj4fi9yYmo?si=lx64sxDdPgLk6CCQ)\n\nI started a channel exclusively recording my XM kills.  Enjoy if you like the sound of close-range headshots. 😅🤣", "post_score": 0, "post_author": "samuellhc", "post_created_utc": "2024-12-04 10:55:00", "comment_count": 2}
{"post_id": "1h6dbus", "post_title": "Vitality made the cringiest video on the internet.", "post_body": "N/A", "post_score": 776, "post_author": "MmX_A_", "post_created_utc": "2024-12-04 10:52:02", "comment_count": 127}
{"post_id": "1h6dbut", "post_title": "Super interesting take from Bubzkji on Falcons (tweet is from when Snappi, dupreeh, maden got benched)", "post_body": "N/A", "post_score": 115, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-04 10:52:02", "comment_count": 47}
{"post_id": "1h6d8j2", "post_title": "XigN forced to take break due to military service in South Korea: \"I will come back stronger\"", "post_body": "N/A", "post_score": 636, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-04 10:45:23", "comment_count": 53}
{"post_id": "1h6cq7s", "post_title": "New train is fun", "post_body": "N/A", "post_score": 3, "post_author": "Reezco", "post_created_utc": "2024-12-04 10:08:50", "comment_count": 1}
{"post_id": "1h6c5mm", "post_title": "Debating whether to put G2 or Spirit as 3-0.", "post_body": "I don’t know much bout the pro scene but I feel G2 goes against harder opponents then spirit what do you think", "post_score": 0, "post_author": "Separate_Ad_9464", "post_created_utc": "2024-12-04 09:26:10", "comment_count": 16}
{"post_id": "1h6c2c7", "post_title": "JDC: \"Transitioning from the supportive guy I was in MOUZ to becoming more of a playmaker now is it's a huge step for me\"", "post_body": "N/A", "post_score": 99, "post_author": "Soft_Bed_412", "post_created_utc": "2024-12-04 09:19:04", "comment_count": 2}
{"post_id": "1h6bxw9", "post_title": "Any else struggling on CT side?", "post_body": "Really struggling on CT side.\nIt happens again and again. I play T side, top frag by a LARGE margin and end the T side with 130 ADR, playing mostly entry. Some games 3:1 kdr.\n\nSwitch to CT, and i just get CLAPPED everywhere i go. I dont hold many angles static, try to use peakers advantage and play smart using my util, but i just for the life of me cannot not get instaheadshottet everywhere i go? It's like the enemy team just toggles wh as soon as they switch to T side.\n\nI legitimately cannot find any reason as to why i can barely rack up 5 kills on my CT side, but just run over everyone on my T side. Do any of you have the same problem? \n\nI'm around 15k atm, was 20k month or two ago, deranked a lot. Used to be Global back in the day and been back for 3-4 months now.", "post_score": 5, "post_author": "Joshua9858", "post_created_utc": "2024-12-04 09:09:24", "comment_count": 18}
{"post_id": "1h6bpcr", "post_title": "CS2 Achievements still missing after a year ", "post_body": "N/A", "post_score": 1964, "post_author": "lurkincirclejerkin", "post_created_utc": "2024-12-04 08:51:07", "comment_count": 184}
{"post_id": "1h6bi7y", "post_title": "How does the swiss format work?", "post_body": "Obviously we can see the first match ups, but from there on how does the next match get decided? Is it based on ranking or is 1-0s play 1-0s....1-1s play 1-1s so on and so forth? If it is that way, is it based on round difference on who play who out of the teams with the same record? \n\n ", "post_score": 1, "post_author": "Bront_7", "post_created_utc": "2024-12-04 08:35:12", "comment_count": 1}
{"post_id": "1h6baxl", "post_title": "Accidental Silent Drop on Anubis", "post_body": "Similar to what another user did \"[https://www.reddit.com/r/GlobalOffensive/comments/1gtc3wa/so\\_today\\_i\\_accidentally\\_dropped\\_silently\\_from\\_mid/?rdt=50806Similar to what another user did \"https://www.reddit.com/r/GlobalOffensive/comments/1gtc3wa/so\\_today\\_i\\_accidentally\\_dropped\\_silently\\_from\\_mid/?rdt=50806\"](https://www.reddit.com/r/GlobalOffensive/comments/1gtc3wa/so_today_i_accidentally_dropped_silently_from_mid/?rdt=50806)\n\nBut i never used any edges to slow my jump, if u want to recreat it from what i remember i released control button right as i landed but i did this a month ago so i forgot.\n\nIf mastered this could make water rotations more effective and change the meta.\n\nhttps://reddit.com/link/1h6baxl/video/3a7sbapgjs4e1/player\n\n", "post_score": 1, "post_author": "Reb1337", "post_created_utc": "2024-12-04 08:19:26", "comment_count": 0}
{"post_id": "1h6atjg", "post_title": "Would an \"anti double click\" mouse macro for stopping double clicks due to a failing switch trigger the anti cheat?", "post_body": "My mouse started doing the classic double click on my left click, and while looking for replacement switches I found a macro which pretty much solves my doubleclick/unable to consistently hold down left click issue.\n\nBasically, the macro is as follows: \n\n- On physical left click press, hold left click for at least 10ms.\n- On physical left click release, hold left click for an extra 10ms before releasing.\n\nThat is it. Just so that when the switch \"lets go\" for a millisecond the click is still held.\n\nIs there any real chance this would be bannable? I'd rather not get a new mouse right now as money is tight, and this seems to completely and totally solve my issue with no real drawbacks.\n\nthanks", "post_score": 0, "post_author": "Confident_Air_5331", "post_created_utc": "2024-12-04 07:43:36", "comment_count": 4}
{"post_id": "1h67995", "post_title": "Elimination stage advancement chances using Valve world ranking", "post_body": "N/A", "post_score": 193, "post_author": "Unlucky-Anybody3394", "post_created_utc": "2024-12-04 04:03:12", "comment_count": 48}
{"post_id": "1h64ywh", "post_title": "Does anyone else hate ancient?", "post_body": "I absolutely despise ancient. Playing T side, there's like three angles you need to clear to get to a bombsite and as a CT there's like two positions you can hold. I don't enjoy holding any position or retaking either site. The map's layout is so incredibly boring. And the best strat I've seen is just rushing B every round because T's somehow get up ramp before the mollys hit them. Why is it such a popular map? I just don't get it.\n\n  \ninb4 \"you're just bad\"", "post_score": 0, "post_author": "GustavoFucksMidgets", "post_created_utc": "2024-12-04 02:06:12", "comment_count": 13}
{"post_id": "1h63en6", "post_title": "Help a mate", "post_body": "Hi guys, I also have a problem with CS2, I'm playing on a low/medium PC, I have no idea, it's a 1660 super 6 gb, 16 ram, i3 10th, I have everything on low, I play with 4:3 1440 1080 and I have moments of lag, in certain areas on certain maps and not always in the same places + I have to play with vsync enabled, if I disable it it runs jerkily badly...", "post_score": 1, "post_author": "Apprehensive-Tie6534", "post_created_utc": "2024-12-04 00:51:16", "comment_count": 4}
